{"edges":[{"label":"","source":"0","target":"0","id":"6","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"1","target":"1","id":"8","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"2","target":"2","id":"10","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"3","target":"3","id":"12","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"4","target":"4","id":"14","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"5","target":"5","id":"16","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"6","target":"6","id":"18","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"7","target":"7","id":"20","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"8","target":"8","id":"22","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"9","target":"9","id":"24","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"10","target":"10","id":"26","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"11","target":"11","id":"28","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"12","target":"12","id":"30","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"13","target":"13","id":"32","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"14","target":"14","id":"34","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"15","target":"15","id":"36","attributes":{},"color":"rgb(136, 186, 225)","size":1.0},{"label":"","source":"16","target":"16","id":"38","attributes":{},"color":"rgb(136, 186, 225)","size":1.0}],"nodes":[{"label":"LS-0123","x":0.0,"y":0.0,"id":"0","attributes":{"Title":"American Sign Language I","Description":"Fall\n2015\nLanguage Study\n0123\nHampshire College\nThis course introduces the third mostly widely used language in the United States and Canada. It is intended to give an overview of both the language and the culture of the deaf community. Emphasis will be focused on learning basic grammatical structure as well as developing receptive and expressive signing skills using in everyday conversation, also being able to give a skit in American Sign Language. Cultural aspects of the Deaf community will be shared through readings, videotapes/DVDS, presenters and class discussion.\nCulture, Humanities, and Languages Multiple Cultural Perspectives In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes practicing sigh language with the DVDs/classmates, doing their student workbooks, doing readings and writing reaction papers/one term paper with their choice of topic related to information about the deaf.\nPermission is required for interchange registration during the add/drop period only.\n318303\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/FALL/LS/0123/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0211","x":1.0,"y":0.0,"id":"1","attributes":{"Title":"Intermediate Chinese I","Description":"Fall\n2015\nLanguage Study\n0211\nHampshire College\nThis course will be taught by a visiting professor of Chinese from the Hampshire College China Exchange program, D. Song and supervised by K. Johnson. Students entering this class will be expected to have completed beginning Chinese or the equivalent of an intensive college-level first year Chinese language course. The main text for the semester will be Integrated Chinese Level 2 Part 1 (Third Edition). Emphasis will be placed equally on speaking, reading, and writing. An additional practice session will be added at a time that suits the students' schedule.\nCulture, Humanities, and Languages Multiple Cultural Perspectives Independent Work Students are expected to spend at least six to eight hours a week of preparation and work outside of class time.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nThis course has unspecified prerequisite(s) - please see the instructor.\nPermission is required for interchange registration during the add/drop period only.\n318517\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/FALL/LS/0211/1'> Course Site </a>","Requisite":["This course has unspecified prerequisite(s) - please see the instructor."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0312","x":2.0,"y":0.0,"id":"2","attributes":{"Title":"Third year Chinese II","Description":"Spring\n2015\nLanguage Study\n0312\nHampshire College\nThird Year Chinese II: This course will be taught by a visiting professor of Chinese from the Hampshire College China Exchange program, D. Song and supervised by K. Johnson. Students entering this class will be expected to have completed Intermediate Chinese or the equivalent of an intensive college-level second year Chinese language course. The main text for the semester will be All Things Considered. Emphasis will be placed equally on speaking, reading, and writing. Students should have completed Integrated Chinese Level 2 or equivalent to enter this class.\nMultiple Cultural Perspectives Students should have completed Integrated Chinese Level 2 or equivalent to enter this class.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nThis course has unspecified prerequisite(s) - please see the instructor.\nPermission is required for interchange registration during the add/drop period only.\n316649\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/SPRING/LS/0312/1'> Course Site </a>","Requisite":["This course has unspecified prerequisite(s) - please see the instructor."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0201","x":3.0,"y":0.0,"id":"3","attributes":{"Title":"Intermediate Spanish I","Description":"Spring\n2016\nLanguage Study\n0201\nHampshire College\nThis course is the first semester of second year Spanish. Students enrolled in this course should have taken LS102 or the equivalent and be able to use the present, future, preterit and imperfect tenses with some fluency and have a working knowledge of the present subjunctive. This course, taught almost entirely in Spanish, is designed to reinforce grammatical structures introduced in first-year Spanish through activities that practice all four skills: speaking, listening, reading and writing. Attention is given to using command forms and the present subjunctive. Classroom activities and topics are connected to the culture and literature of the Spanish-speaking world through the on-line course website as well as students' own experiences. Emphasis is placed on speaking and writing in Spanish. Attendance and classroom participation count for sixty percent of the requirement for credit/evaluation.\nCulture, Humanities, and Languages Multiple Cultural Perspectives This class is taught by faculty from the International Language Institute of Massachusetts in Northampton (www.ili.edu). For more information regarding placement in this course, please contact Samira Artur, saLS@hampshire.edu. In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes time spent on on-line homework, forum discussions on Moodle, as well as portfolio work.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nUNSP-0000 is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n319757\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0201/1'> Course Site </a>","Requisite":["UNSP-0000 is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0107","x":4.0,"y":0.0,"id":"4","attributes":{"Title":"Beginning Chinese","Description":"Spring\n2015\nLanguage Study\n0107\nHampshire College\nThis is a non-intensive beginning Chinese course for students who want to learn Chinese but do not have time for a regular intensive Chinese class. The course includes an introduction to the phonetic system of Chinese (Hanyu pinyin) and approximately 180 basic simplified Chinese characters. We will emphasize basic grammatical structures, vocabulary for daily conversation and students' oral expression. Content covers lessons 1-5 of Integrated Chinese Level 1. The class will meet two hours a week plus one hour of practice.  Class times will be determined the first week of classes to suit the schedules of the students who sign up for the course\nCulture, Humanities, and Languages Multiple Cultural Perspectives First time meeting will be held Wed, January 21  from 7:00-9:00p.m. in FPH-104.   Students are expected to spend at least three hours a week of preparation and work outside of class time.\nPermission is required for interchange registration during the add/drop period only.\n317043\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/SPRING/LS/0107/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0112","x":5.0,"y":0.0,"id":"5","attributes":{"Title":"Elementary Chinese II","Description":"Spring\n2016\nLanguage Study\n0112\nHampshire College\nThis course will be taught by Danni Song, a visiting professor of Chinese from the Hampshire College China Exchange program, and supervised by Professor Kay Johnson. It will cover the second semester of beginning Chinese. The course will follow the Integrated Chinese textbook series. The class will cover speaking, reading, and writing Chinese characters. Required books are: Integrated Chinese Textbook Level 1, Part 2; Integrated Chinese Workbook Level 1, Part 2; Integrated Chinese Character Workbook, Level 1, Part 2. Students should have completed one semester of college level Chinese or its equivalent.\nCulture, Humanities, and Languages Multiple Cultural Perspectives Students are expected to spend at least six to eight hours a week of preparation and work outside of class time.\nPermission is required for interchange registration during the add/drop period only.\n319947\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0112/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0202","x":6.0,"y":0.0,"id":"6","attributes":{"Title":"Intermediate Spanish II","Description":"Spring\n2016\nLanguage Study\n0202\nHampshire College\nThis course is the second semester of second-year Spanish. Students enrolled should have taken LS201 or the equivalent and be able to use the present, future, preterit, imperfect tenses, command forms and present subjunctive with some fluency. This course will solidify grammatical structures of Spanish through activities that practice all four skill areas: speaking, listening, reading and writing. Attention will be given to more sophisticated use of the subjunctive and compound tenses. Classroom activities and topics are connected to the culture and literature of the Spanish-speaking world as well as students' own experiences. Emphasis is placed on speaking and writing in Spanish. Attendance and classroom participation count for 70 percent of the requirement for credit/evaluation.\nCulture, Humanities, and Languages Multiple Cultural Perspectives This class is taught by faculty from the International Language Institute of Massachusetts in Northampton (www.ili.edu). For more information regarding placement in this course, please contact Caroline Gear, caroline@ili.edu. In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes time spent on on-line homework, forum discussions on Moodle, as well as portfolio work.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nUNSP-0000 is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n319760\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0202/1'> Course Site </a>","Requisite":["UNSP-0000 is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0311","x":7.0,"y":0.0,"id":"7","attributes":{"Title":"Third Year Chinese I","Description":"Fall\n2014\nLanguage Study\n0311\nHampshire College\nThird Year Chinese I: This course will be taught by a visiting professor of Chinese from the Hampshire College China Exchange program, D. Song and supervised by K. Johnson. Students entering this class will be expected to have completed Intermediate Chinese or the equivalent of an intensive college-level second year Chinese language course. The class will cover the final chapters of Integrated Chinese Level 2, part 2 and then proceed to Reading Into A New China. Emphasis will be placed equally on speaking, reading, and writing. By the end of the Fall semester, students will be expected to have mastered all of the grammar patterns and characters (both recognition and writing from memory) introduced in the Integrated Chinese series, Levels 1 and 2 and Reading Into A New China, vol. 1. The second semester of Third Year Chinese will be offered during the spring semester.\nMultiple Cultural Perspectives Pre-requisite:  Completion of an intensive second year Chinese college course or equivalent is required to enter this class.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nThis course has unspecified prerequisite(s) - please see the instructor.;There is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n315453\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2014/FALL/LS/0311/1'> Course Site </a>","Requisite":["Multiple Cultural Perspectives Pre-requisite:  Completion of an intensive second year Chinese college course or equivalent is required to enter this class.","This course has unspecified prerequisite(s) - please see the instructor.;There is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0104","x":8.0,"y":0.0,"id":"8","attributes":{"Title":"Beginning Yiddish II","Description":"Spring\n2015\nLanguage Study\n0104\nHampshire College\nSpoken by the largest number of Jews for the longest period of time in the most countries all over the world of all Jewish languages, Yiddish is the key to understanding Eastern European Jewish life. This course is a continuation of first-semester Yiddish. Students will continue to develop basic proficiency in all four major communicative skills: speaking, listening, reading, and writing, using textbook materials, original literary texts, audio-visual sources, and student-led group work. Students will be expected to practice the material daily, using written and oral exercises, outside of class. There will be a once-weekly mandatory conversation section with the course TA in addition to the scheduled class meetings.\nCulture, Humanities, and Languages Multiple Cultural Perspectives In this course, students are expected to spend 8-10 hours weekly on preparation and work outside of class time.\nPermission is required for interchange registration during the add/drop period only.\n317017\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/SPRING/LS/0104/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0205","x":9.0,"y":0.0,"id":"9","attributes":{"Title":"American Sign Language III","Description":"Fall\n2014\nLanguage Study\n0205\nHampshire College\nThis course enhances on skills learned in American Sign Language, Level II. It emphasizes and expands the use of more complex grammar, syntax, vocabulary, classifiers, dialogues and narratives. Information about the Deaf Community and Deaf Culture are included.   Prerequisite: Successful completion of American Sign Language, Level II or equivalent proficiency.\nMultiple Cultural Perspectives In this course, students are expected to spend at least six to eight hours a week of  preparation and work outside of class time. The time involves using the student workbook and DVDs, practicing American Sign Language, creating videos, doing readings, and writing reaction papers and one term paper. They are expected to attend ASL lunch at the Dining Commons at least four times and are encouraged to attend two events in the Deaf community.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nThis course has unspecified prerequisite(s) - please see the instructor.\nPermission is required for interchange registration during the add/drop period only.\n315937\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2014/FALL/LS/0205/1'> Course Site </a>","Requisite":["This course enhances on skills learned in American Sign Language, Level II. It emphasizes and expands the use of more complex grammar, syntax, vocabulary, classifiers, dialogues and narratives. Information about the Deaf Community and Deaf Culture are included.   Prerequisite: Successful completion of American Sign Language, Level II or equivalent proficiency.","This course has unspecified prerequisite(s) - please see the instructor."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0124","x":10.0,"y":0.0,"id":"10","attributes":{"Title":"American Sign Language II","Description":"Spring\n2016\nLanguage Study\n0124\nHampshire College\nThis course furthers the development of receptive and expressive signing skills. The course introduces the more complex grammatical structure including signing space, body posture and facial expression. More information about the deaf community will be done through readings, videotapes/DVDs. class discussion, presenters and events. Prerequisite: successful completion of American Sign Language I or equivalent proficiency.\nCulture, Humanities, and Languages Multiple Cultural Perspectives In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes doing student workbooks, practicing sign language with the DVDs/classmates, doing readings and writing reaction papers/one term paper about interpreting. They are expected to attend ASL lunch at the Dining Commons at least four times and are encouraged to be at an event in the deaf community.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nUNSP-0000 is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n319759\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0124/1'> Course Site </a>","Requisite":["This course furthers the development of receptive and expressive signing skills. The course introduces the more complex grammatical structure including signing space, body posture and facial expression. More information about the deaf community will be done through readings, videotapes/DVDs. class discussion, presenters and events. Prerequisite: successful completion of American Sign Language I or equivalent proficiency.","UNSP-0000 is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0111","x":11.0,"y":0.0,"id":"11","attributes":{"Title":"Elementary Chinese I","Description":"Fall\n2015\nLanguage Study\n0111\nHampshire College\nElementary Chinese I: This course will be taught by a visiting professor of Chinese from the Hampshire College China Exchange program and supervised by Professor Kay Johnson. It will cover the first semester of beginning Chinese. The second semester of beginning Chinese language will be offered during the spring semester. The course will follow the Integrated Chinese textbook series. The class will cover speaking, reading, and writing Chinese characters. Required books are: Integrated Chinese Textbook Level 1, Part 1; Integrated Chinese Workbook Level 1, Part 1; Integrated Chinese Character Workbook, Level 1, Part 1.\nCulture, Humanities, and Languages Multiple Cultural Perspectives\nPermission is required for interchange registration during the add/drop period only.\n318302\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2015/FALL/LS/0111/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0212","x":12.0,"y":0.0,"id":"12","attributes":{"Title":"Intermediate Chinese","Description":"Spring\n2016\nLanguage Study\n0212\nHampshire College\nThis course will be taught by a visiting professor of Chinese from the Hampshire College China Exchange Program.  Danni Song and supervised by Kay Johnson.  Students entering this class will be expected to have completed beginning Chinese or the equivalent of an intensive college-level first year Chinese language course.  The main text for the semester will be Integrated Chinese Level 2 Part 1 and Level 2 Part 2 (Third Edition).  Emphasis will be placed equally on speaking, reading, and writing.  An additional practice session will be added at a time that suits the students' schedule.\nCulture, Humanities, and Languages Multiple Cultural Perspectives Students are expected to spend at least six to eight hours a week of preparation and work outside of class time.\nPermission is required for interchange registration during the add/drop period only.\n319948\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0212/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0102","x":13.0,"y":0.0,"id":"13","attributes":{"Title":"Elementary Spanish II","Description":"Spring\n2016\nLanguage Study\n0102\nHampshire College\nThis course is the second semester of first-year, Spanish and students enrolled in this course should have taken LS101 or the equivalent. This class is taught almost entirely in Spanish and focuses on speaking and using the target language. Students entering this level should be able to use the present, future (ir+a+infinitive) and preterit with some fluency and accuracy. Attention is given to building accuracy with grammatical structures introduced in LS101 and focuses on the differences between the preterit and imperfect tenses along with an introduction to present subjunctive. More sophisticated grammar is also introduced in this course. All four skill areas (speaking, listening, reading and writing) are practiced through activities that are based on real-life situations, the on-line course website and the students' experiences. Classroom attendance and classroom participation count for seventy percent of the requirement for credit/evaluation.\nCulture, Humanities, and Languages Multiple Cultural Perspectives This class is taught by faculty from the International Language Institute of Massachusetts in Northampton (www.ili.edu). For more information regarding placement in this course, please contact Caroline Gear,caroline@ili.edu. In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes time spent on on-line homework, forum discussions on Moodle, as well as portfolio work.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nUNSP-0000 is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n319756\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0102/1'> Course Site </a>","Requisite":["UNSP-0000 is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0110","x":14.0,"y":0.0,"id":"14","attributes":{"Title":"Elementary Arabic II","Description":"Spring\n2016\nLanguage Study\n0110\nHampshire College\nElementary Arabic II, the second semester of First-Year Arabic that introduces the basics of Modern Standard Arabic, this course concentrates on all four skills: speaking, listening, reading and writing. Students will begin with chapter 6 of Al Kitaab and complete Chapter 13 in Al Kitaab Book I by the end of the academic year. Students will acquire vocabulary and usage for everyday interactions as well as skills that will allow them to read and analyze a range of texts. In addition to the traditional textbook exercises, students will write short essays and participate in role plays, debates, and conversations throughout the year. The course follows an integrated methodology of language instruction through introducing one of the Arabic dialects to be integrated with the Modern Standard Arabic Instruction.\nCulture, Humanities, and Languages Independent Work Multiple Cultural Perspectives Part of the Five College language consortium. Students enrolled in the fall term must re-register for spring. Students are expected to spend two hours to prepare for each class.\nMultiple required components--lab and/or discussion section. To register, submit requests for all components simultaneously.\nUNSP-0000 is a recommended corequisite to this course.\nPermission is required for interchange registration during the add/drop period only.\n319758\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0110/1'> Course Site </a>","Requisite":["UNSP-0000 is a recommended corequisite to this course."]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0103","x":15.0,"y":0.0,"id":"15","attributes":{"Title":"Beginning Yiddish I","Description":"Fall\n2014\nLanguage Study\n0103\nHampshire College\nSpoken by the largest number of Jews for the longest period of time in the most countries all over the world of all Jewish languages, Yiddish is the key to understanding Eastern European Jewish life. This course will provide a comprehensive introduction to Yiddish language and culture, with an emphasis on language acquisition. Students will develop basic proficiency in all four major communicative skills: speaking, listening, reading, and writing, using textbook materials, original literary texts, audio-visual sources, and student-led group work. Students will be expected to practice the material daily, using written and oral exercises, outside of class. The course will also introduce students to the history of the Yiddish language and the breadth of Yiddish culture. This course runs for two semesters, and students are encouraged (but not required) to take both semesters of First Year Yiddish. There will be a once-weekly mandatory conversation section with the course TA in addition to the scheduled class meetings.\nCulture, Humanities, and Languages Independent Work In this course students are expected to spend 8-10 hours weekly in preparation and work outside of class time.\nPermission is required for interchange registration during the add/drop period only.\n315456\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2014/FALL/LS/0103/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0},{"label":"LS-0101","x":16.0,"y":0.0,"id":"16","attributes":{"Title":"Elementary Spanish I","Description":"Spring\n2016\nLanguage Study\n0101\nHampshire College\nThis course is designed for students with no background in Spanish. Students are introduced to basic grammatical structures including present, preterit and future (ir + a + infinitive tenses) and by the end of the semester should be able to communicate in verbal and written forms about personal information, daily activities, future plans and past experiences. All four skill areas (speaking, listening, reading and writing) are practiced through activities that are based on real-life situations and the students' experiences. Attendance and participation count for seventy percent of the requirement for credit/evaluation.\nCulture, Humanities, and Languages Multiple Cultural Perspectives This class is taught by faculty from the International Language Institute of Massachusetts in Northampton (www.ili.edu). For more information regarding placement in this course, please contact Caroline Gear,caroline@ili.edu. In this course, students are expected to spend at least six to eight hours a week of preparation and work outside of class time. This time includes time spent on on-line homework as well as portfolio work.\nPermission is required for interchange registration during the add/drop period only.\n319755\n \n ","Department Code":"LS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/HC/2016/SPRING/LS/0101/1'> Course Site </a>","Requisite":[]},"color":"rgb(136, 186, 225)","size":10.0}]}