{"edges":[{"label":"","source":"0","target":"0","id":"6","attributes":{},"color":"rgb(118, 237, 98)","size":1.0},{"label":"","source":"1","target":"1","id":"8","attributes":{},"color":"rgb(118, 237, 98)","size":1.0},{"label":"","source":"2","target":"2","id":"10","attributes":{},"color":"rgb(118, 237, 98)","size":1.0},{"label":"","source":"3","target":"3","id":"12","attributes":{},"color":"rgb(118, 237, 98)","size":1.0},{"label":"","source":"4","target":"4","id":"14","attributes":{},"color":"rgb(118, 237, 98)","size":1.0}],"nodes":[{"label":"COLL-250WG","x":0.0,"y":0.0,"id":"0","attributes":{"Title":"War: What Is It Good For?","Description":"Spring\n2015\nCollege(Interdeptmnt) Courses\n250WG\nMount Holyoke College\nA multidisciplinary examination of the various ways humans have understood, represented, experienced, and justified war over time and across cultures. The course considers the representation of war through art, literature, and music. It analyzes possible causes of war, including innate human drives, gender differences, socialization, and economic and resource competition. In addition, it examines justifications for war from a range of ethical perspectives. Faculty from various disciplines will be asked to guest lecture.\nPermission is required for interchange registration during the add/drop period only.\n91603\n \n ","Department Code":"COLL","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/MHC/2015/SPRING/COLL/250WG/01'> Course Site </a>","Requisite":[]},"color":"rgb(118, 237, 98)","size":10.0},{"label":"COLL-211","x":1.0,"y":0.0,"id":"1","attributes":{"Title":"Reflecting: Intern./Research","Description":"Fall\n2015\nCollege(Interdeptmnt) Courses\n211\nMount Holyoke College\nLearn to speak with confidence and clarity about your summer internship or research project. What have you learned? How is it useful? What are your next steps? Students will reflect on their experience and collaborate with others to generate useful knowledge. Required for the Nexus but open to all students. For more information, email nexus-wm@mtholyoke.edu.\nClass meeting dates: 9/14, 9/21, 9/28, 10/5, 10/19, 10/23 (LEAP Symposium), 10/26. All students will present at LEAP Symposium on 10/23.\nPermission is required for interchange registration during the add/drop period only.\n93643\n \n ","Department Code":"COLL","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/MHC/2015/FALL/COLL/211/01'> Course Site </a>","Requisite":[]},"color":"rgb(118, 237, 98)","size":10.0},{"label":"COLL-115GR","x":2.0,"y":0.0,"id":"2","attributes":{"Title":"Global Challenges","Description":"Spring\n2016\nCollege(Interdeptmnt) Courses\n115GR\nMount Holyoke College\nOver the last two decades, the globalization of production and labor markets has made jobs and working conditions increasingly more precarious around the world. Against this backdrop we are now at the dawn of a technological revolution with potentially systemic impact on production, jobs, and livelihoods. Through analysis and hands-on activities, we study the impact of globalization and robotization on the future of jobs in the Global North and South. Where will the jobs of the future be? If technology were to enable us to work less, what would new social contracts have to look like so that people can have a decent living?\nThe course meets Wednesday nights (Jan 20, 27, Febr 3, 10, 17, March 2), 7-9:30 pm. Class length will vary depending on activity (lecture, discussion, lab work). Students are required to attend the conference on the same topic (Febr 19-20).\nPermission is required for interchange registration during the add/drop period only.\n95484\n \n ","Department Code":"COLL","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/MHC/2016/SPRING/COLL/115GR/01'> Course Site </a>","Requisite":[]},"color":"rgb(118, 237, 98)","size":10.0},{"label":"COLL-225LP","x":3.0,"y":0.0,"id":"3","attributes":{"Title":"Leadership & Public Service","Description":"Fall\n2015\nCollege(Interdeptmnt) Courses\n225LP\nMount Holyoke College\nWhat does leadership in the public sphere look like? What does it mean to be an influential leader as an elected official, a policy advocate, or a public servant? In this six-week course, we will examine research literature and case examples, and hear from speakers from different aspects in the public service realm. Topics will include leadership capacities, issue advocacy, working with constituents, women's experiences, and effective mentoring and networking. Students will complete one project relevant to public impact.\nCourse limited to sophomores, juniors and seniors\nHalf-semester course.\nPermission is required for interchange registration during the add/drop period only.\n93545\n \n ","Department Code":"COLL","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/MHC/2015/FALL/COLL/225LP/01'> Course Site </a>","Requisite":[]},"color":"rgb(118, 237, 98)","size":10.0},{"label":"COLL-110","x":4.0,"y":0.0,"id":"4","attributes":{"Title":"Science in the World","Description":"Fall\n2015\nCollege(Interdeptmnt) Courses\n110\nMount Holyoke College\nThis seminar is designed for students who have transferred to Mount Holyoke to pursue a major in the sciences or mathematics. Through it, we connect you to people and resources that will help you fully engage in the sciences at Mount Holyoke. We will study an interdisciplinary science topic (the biology of stress), use the primary literature as a text, and gain practice with writing. You will learn some of the common expectations of upper-level science courses and find out about resources to help you succeed. In addition, you will gain practice assessing and articulating your skills as we walk through finding and applying for a science or math internship.\nPermission is required for interchange registration during all registration periods.\n93544\n \n ","Department Code":"COLL","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/MHC/2015/FALL/COLL/110/01'> Course Site </a>","Requisite":[]},"color":"rgb(118, 237, 98)","size":10.0}]}