{"nodes":[{"label":[0,"EDUC-331"],"x":1.5,"y":2.0,"id":"0","attributes":{"Title":"Teach: Sec & Middle School","Description":"Spring\n2016\nEducation\n331\nMount Holyoke College\nStudents participate in full-time student teaching in middle or secondary classrooms for 12 weeks. During this semester-long field-based placement, students hone classroom management skills, design and implement curriculum, and develop a wide range of assessment skills. Students work with classroom teachers and college supervisors to address Professional Teaching Standards as required by the Commonwealth of Massachusetts' Pre-service Performance Assessment Program\nThis course is limited to seniors.; Prereq: Education 320 and Education 330.\n5 days a week for 12 weeks; full-time student teaching in school sites (includes Mount Holyoke College's/Amherst College's spring break); students must apply for and be accepted into the practicum semester a year prior to the practicum.\nPermission is required for interchange registration during all registration periods.\n95164\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/331/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[1,"EDUC-320"],"x":2.5,"y":1.0,"id":"1","attributes":{"Title":"Obser & Assist/Inclusive Clsrm","Description":"Spring\n2016\nEducation\n320\nMount Holyoke College\nStudents are expected to complete a supervised field experience full-time every day during January Intersession in an inclusive classroom in a school setting. Placements can be located within or outside of the Five College area. In addition to the field experience component, students attend three course meetings (detailed below).  Reading and writing assignments focus on a survey of learning disabilities, descriptions of special education programs, understanding Individuals with Disabilities Education Act policies and placement options, interpreting Individualized Education Program plans, and planning curriculum for inclusive classrooms.\nPrereq: One of the following: Psychology 230, Psychology 233, Education 205, or Educational Studies 215.\nThis course is required of all students pursuing teacher licensure. Graded on a credit/no credit basis.\nPermission is required for interchange registration during the add/drop period only.\n95159\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/320/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[2,"EDUC-205"],"x":3.0,"y":0.0,"id":"2","attributes":{"Title":"Racism/Inequal in Schools/Soc","Description":"Spring\n2016\nEducation\n205\nMount Holyoke College\nWhat is race? Who decides? Are we a postracial society? This course examines the historical, social, and legal underpinnings of the social construction of race and how perspectives on race have influenced lives within school communities. Classes compare old vs. new racism, contrast the workings of white privilege with calls for white responsibility, explore perspectives on the achievement and opportunity gaps, and examine impact of antiracist pedagogies on inequities in education at the curricular, interpersonal, and institutional levels. Intersectionality of race and other identities will also be addressed. Essays, response papers, field experiences, and final project are required.\nCourse limited to sophomores, juniors and seniors\nPrepracticum required.\nPermission is required for interchange registration during the add/drop period only.\n95152\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/205/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[3,"EDUC-263"],"x":7.0,"y":0.0,"id":"3","attributes":{"Title":"Teaching English Lang Learners","Description":"Fall\n2015\nEducation\n263\nMount Holyoke College\nThis course addresses core competencies outlined in the Massachusetts Department of Education's English Language Learner certificate requirement. Readings in language acquisition theory, language learning and teaching, effective lesson design and assessment, Sheltered Instruction Observation Protocol, and knowledge of intercultural learners are covered. Students will have experience developing and adapting lessons and curriculum to address the needs of students in their pre-practicum settings.\nPermission is required for interchange registration during all registration periods.\n93286\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2015/FALL/EDUC/263/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[4,"EDUC-395P"],"x":8.0,"y":0.0,"id":"4","attributes":{"Title":"Independent Study w/Practicum","Description":"Spring\n2016\nEducation\n395P\nMount Holyoke College\n1.00-8.00 credits.\nPermission is required for interchange registration during all registration periods.\n96324\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/395P/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[5,"EDUC-332"],"x":9.0,"y":0.0,"id":"5","attributes":{"Title":"Observe/Asst Sec Mid Sch","Description":"Spring\n2016\nEducation\n332\nMount Holyoke College\nThis is a fieldwork-based independent study course. During the fall and spring semesters it involves 20 to 40 hours of individually scheduled fieldwork in a secondary or middle school classroom or educational program. Students keep a reflective journal, read relevant articles and essays, meet regularly with the instructor, and write a final report.\n1.00-2.00 credits. This course is graded on a credit/no credit basis.\nPermission is required for interchange registration during all registration periods.\n95166\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/332/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[6,"EDUC-322"],"x":10.0,"y":0.0,"id":"6","attributes":{"Title":"Practicum Seminar","Description":"Spring\n2016\nEducation\n322\nMount Holyoke College\nThis weekly seminar provides students with opportunities to examine curriculum development models, develop an integrated curriculum unit utilizing state and national content area standards, review researched based models of classroom management, and engage in dialogue with practicing teachers regarding numerous aspects of teaching and student learning. Additional topics covered include the arts in education, physical education, legal obligations of teachers, and home-school communication. As is the case in all pre-licensure programs, there is continued emphasis on addressing the needs of students with disabilities and English Language Learners.\nPermission is required for interchange registration during all registration periods.\n95161\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/322/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[7,"EDUC-351RT"],"x":11.0,"y":0.0,"id":"7","attributes":{"Title":"Critical Race Theory in Educ.","Description":"Spring\n2016\nEducation\n351RT\nMount Holyoke College\nCourse focuses on Critical Race Theory, its history and application in the field of Education. Through course readings and assignments, students will explore and discuss key issues such as race/racism, class/classism, gender/sexism among other isms and how they impact the teaching and learning experiences of students of color. This course is specifically designed to challenge students and make them think critically about their multiple identities, privileges and challenges as students and future leaders. The goal is gain a critical understanding of the connection between theory, research, and practice in order to better understand educational structures, processes, and discourses.\nStudents interested in careers within Education are highly encouraged to enroll.\nPermission is required for interchange registration during the add/drop period only.\n95529,95493\n95493\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/351RT/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[8,"EDUC-295P"],"x":12.0,"y":0.0,"id":"8","attributes":{"Title":"Independent Study w/Practicum","Description":"Fall\n2014\nEducation\n295P\nMount Holyoke College\n1.00-4.00 credits\nPermission is required for interchange registration during all registration periods.\n90679\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2014/FALL/EDUC/295P/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[9,"EDUC-295"],"x":13.0,"y":0.0,"id":"9","attributes":{"Title":"Independent Study","Description":"Spring\n2016\nEducation\n295\nMount Holyoke College\n1.00-4.00 credits.\nPermission is required for interchange registration during all registration periods.\n95679\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/295/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[10,"EDUC-300"],"x":5.0,"y":0.0,"id":"10","attributes":{"Title":"Devel. Literacy in Early/Elem","Description":"Spring\n2016\nEducation\n300\nMount Holyoke College\nThrough a balanced and integrated approach students will learn to develop literacy in early childhood/elementary schools. Class members will learn about emergent literacy, diagnosing language needs, integrating phonics skills in a literature-based program, the teaching of process writing, children's fiction and nonfiction literature, and the use of portfolios for assessment. Course required for spring semester practicum students. Course evaluation is based on written and oral work done individually and in groups. Requires a prepracticum.\nPrepracticum required.\nPermission is required for interchange registration during all registration periods.\n95158\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/300/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[11,"EDUC-330"],"x":0.0,"y":0.0,"id":"11","attributes":{"Title":"Teach/Learn: Sec & Mid School","Description":"Fall\n2015\nEducation\n330\nMount Holyoke College\nThis course addresses the question: what does teaching for understanding look like, and how can we plan for it? Informed by current research and effective teaching practice, students learn to plan and implement curricular units and lessons that engage adolescents, strengthen their literacy skills, and further their understanding of content.  Topics include establishing a supportive classroom environment, designing equitable learning situations for students from diverse racial, ethnic,cultural and linguistic backgrounds as well as students with special needs, using digital media to enhance learning, and examining the connections between pedagogy and classroom management.\nRequires a field-experience in an educational setting. Required for all teacher candidates accepted into the middle and secondary teacher licensure programs.\nPermission is required for interchange registration during all registration periods.\n93290\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2015/FALL/EDUC/330/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[12,"EDUC-333"],"x":14.0,"y":0.0,"id":"12","attributes":{"Title":"Practicum Seminar","Description":"Spring\n2016\nEducation\n333\nMount Holyoke College\nThis weekly seminar provides students with opportunities to design and discuss case studies involving adolescents in middle and secondary school settings, review researched-based models of instruction, and classroom management, and engage in dialogue with professionals regarding numerous aspects of teaching and student learning. Additional topics covered include reviewing the legal obligations of teachers, addressing the needs of students with disabilities, English language learners, and developing effective communication between home and school.\nPermission is required for interchange registration during all registration periods.\n95194\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/333/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[13,"EDUC-324"],"x":15.0,"y":0.0,"id":"13","attributes":{"Title":"Obser & Assist/Early & Elem","Description":"Spring\n2016\nEducation\n324\nMount Holyoke College\nDiscussions and fieldwork provide the student with an opportunity to understand the classroom as a learning community. The tutorial includes several meetings focusing on the student's participant observations and assigned readings. Fieldwork includes a minimum of 20 hours on site, individually scheduled in early childhood (pre K-2) or elementary (1-6) settings. Assessment includes in-progress reports and a final project related to fieldwork. Course graded on a credit/no credit basis.\n1.00-2.00 credits. 1 credit (20 hours of prepracticum); 2 credits (40 hours or more of prepracticum).\nPermission is required for interchange registration during all registration periods.\n95163\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/324/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[14,"EDUC-256TM"],"x":16.0,"y":0.0,"id":"14","attributes":{"Title":"Syst. of Tens/Meaning for Ops","Description":"Fall\n2014\nEducation\n256TM\nMount Holyoke College\nThe course is designed to develop students' conceptual knowledge of the mathematics children encounter in grades K-8 and deepen their understanding of how children make sense of these mathematical concepts in meaningful ways. Students are expected to participate fully in this active and engaging class environment. They will pose questions, share ideas, and contribute to the work and discussions that take place in small groups and whole group situations. There will be weekly reading and writing assignments and maintenance of a portfolio. Students are required to have access to early childhood, elementary, or middle school students for four assignments during the semester.\nPermission is required for interchange registration during all registration periods.\n89669,89668,89690\n89669\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2014/FALL/EDUC/256TM/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[15,"EDUC-323"],"x":5.0,"y":2.0,"id":"15","attributes":{"Title":"Erly Childhood/Elem Practicum","Description":"Spring\n2016\nEducation\n323\nMount Holyoke College\nStudents participate in full-time student teaching in early childhood and elementary classrooms for 12 weeks. During this semester-long field-based placement, students hone classroom management skills, implement an extended integrated curriculum unit, deliver lessons in all content areas, and develop a wide range of assessment skills. The practicum culminates in two weeks of Lead Teaching, during which the student is responsible for managing all aspects of the classroom program. Students work with classroom teachers and college supervisors to address Professional Teaching Standards as required by the Commonwealth of Massachusetts' Pre-service Performance Assessment Program.\nThis course is limited to seniors.; Prereq: Education 300, Education 320, and Education 325.\n5 days a week for 12 weeks full-time student teaching in school site (includes Mount Holyoke College's spring break); limited to students accepted to the practicum year program.\nPermission is required for interchange registration during all registration periods.\n95162\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/323/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[16,"EDUC-233"],"x":1.0,"y":0.0,"id":"16","attributes":{"Title":"Educational Psychology","Description":"Spring\n2016\nEducation\n233\nMount Holyoke College\nWhat do we learn? How do we learn? Why do we learn? In this course, we will study issues of learning, teaching, and motivation that are central to educational psychology. We will explore the shifting paradigms within educational psychology, multiple subject matter areas, (dis)continuities between classroom and home cultures, students' prior experiences, teachers as learners, ethnic and gender identity in the classroom, and learning in out-of-school settings. Requires a prepracticum in a community-based setting.\nPrepracticum required. Many of the available placements for this course are in after-school settings (one afternoon per week)\nPermission is required for interchange registration during the add/drop period only.\n95157,95115\n95157\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/233/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[17,"EDUC-325"],"x":6.0,"y":0.0,"id":"17","attributes":{"Title":"Teach/Learn: Math/Science","Description":"Fall\n2015\nEducation\n325\nMount Holyoke College\nStudents will learn about inquiry-based science/math curriculum and use of technology in PreK-6 classroom. They will construct more extensive understandings of science/math instruction by developing lessons that implement the Massachusetts Frameworks incorporating the Common Core State Standards for Mathematics. They will teach a minimum of three lessons to students in their pre-practicum setting. Emphasis will be on learning diverse management and instructional practices, such as the use of manipulatives, problem solving, cooperative learning, and project-based learning. Students will also become more adept at developing effective approaches to using assessment to guide instruction.\nPre-practicum required\nPermission is required for interchange registration during all registration periods.\n93289\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2015/FALL/EDUC/325/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[18,"EDUC-395"],"x":17.0,"y":0.0,"id":"18","attributes":{"Title":"Independent Study","Description":"Spring\n2016\nEducation\n395\nMount Holyoke College\n1.00-8.00 credits.\nPermission is required for interchange registration during all registration periods.\n96311\n \n ","Department Code":"EDUC","Course Site":"<a href= '/courses/MHC/2016/SPRING/EDUC/395/01'> Course Site </a>","Requisite":[]},"color":"rgb(226, 217, 6)","size":10.0},{"label":[19,"EDUC-230"],"x":2.0,"y":0.0,"id":"(19, 'EDUC-230')","attributes":{"Title":[19,"EDUC-230"],"Description":"not offered in the last 4 semesters","Department Code":"EDUC","Course Site":"","Requisite":""},"color":"rgb(226, 217, 6)","size":10.0},{"label":[20,"EDUC-215"],"x":4.0,"y":0.0,"id":"(20, 'EDUC-215')","attributes":{"Title":[20,"EDUC-215"],"Description":"not offered in the last 4 semesters","Department Code":"EDUC","Course Site":"","Requisite":""},"color":"rgb(226, 217, 6)","size":10.0}],"edges":[{"label":"","source":"0","target":"0","id":"6","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"1","target":"0","id":"8","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"1","target":"1","id":"10","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"1","target":"15","id":"12","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"2","target":"1","id":"14","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"2","target":"2","id":"16","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"3","target":"3","id":"18","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"4","target":"4","id":"20","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"5","target":"5","id":"22","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"6","target":"6","id":"24","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"7","target":"7","id":"26","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"8","target":"8","id":"28","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"9","target":"9","id":"30","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"10","target":"10","id":"32","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"10","target":"15","id":"34","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"11","target":"0","id":"36","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"11","target":"11","id":"38","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"12","target":"12","id":"40","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"13","target":"13","id":"42","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"14","target":"14","id":"44","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"15","target":"15","id":"46","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"16","target":"1","id":"48","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"16","target":"16","id":"50","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"17","target":"15","id":"52","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"17","target":"17","id":"54","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"18","target":"18","id":"56","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"19","target":"1","id":"58","attributes":{},"color":"rgb(226, 217, 6)","size":1.0},{"label":"","source":"20","target":"1","id":"60","attributes":{},"color":"rgb(226, 217, 6)","size":1.0}]}