{"edges":[{"label":"","source":"3","target":"3","id":"6","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"5","target":"5","id":"8","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"7","target":"7","id":"10","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"13","target":"13","id":"12","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"14","target":"14","id":"14","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"16","target":"16","id":"16","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"17","target":"17","id":"18","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"31","target":"31","id":"20","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"36","target":"36","id":"22","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"41","target":"41","id":"24","attributes":{},"color":"rgb(88, 105, 178)","size":1.0},{"label":"","source":"47","target":"29","id":"26","attributes":{},"color":"rgb(88, 105, 178)","size":1.0}],"nodes":[{"label":"FFYS-197SCH","x":0.0,"y":0.0,"id":"0","attributes":{"Title":"Design, Visual Thinking, and T","Description":"Spring\n2015\nFaculty First Year Seminars\n197SCH3\nUMass Amherst\nDesign, Visual Thinking & Technology: Fundamentals of Visualization for Millennials offers first-year students the opportunity to learn the basics of design, visual thinking and the technology applications-Google Drive, Prezi, Storify, Pinterest, Tableau Public, and the Advanced Features of MS PowerPoint. Topics include principles of design, layout, typography, color, and data visualization. In this seminar, students will work on both individual and collaborative assignments in a computer lab and become familiar with technology applications in the completion of these assignments. Overall, students will gain an understanding of the fundamentals of visual design, visual meaning, aesthetic form, & technology applications, and their significance and relevance in communicating messages to the intended audience.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19800\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197SCH3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197MUS","x":1.0,"y":0.0,"id":"1","attributes":{"Title":"Creativity and Imagination","Description":"Fall\n2015\nFaculty First Year Seminars\n197MUS2\nUMass Amherst\nThis course will explore the integral role that creativity, imagination, and curiosity play in a fulfilling life and successful career. It will challenge you to move outside of your existing comfort zone through creative activities and discussions and help you recognize the value and power of being an imaginative, forward-thinking individual.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40408\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197MUS2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197EDU","x":2.0,"y":0.0,"id":"2","attributes":{"Title":"Educating America's Youngest","Description":"Fall\n2015\nFaculty First Year Seminars\n197EDUC1\nUMass Amherst\nEarly childhood education has been making the news. President Obama and Massachusetts Governor Baker have prominently identified early childhood education as a major goal for their administrations. In this seminar we?ll explore the diverse contexts in which early education takes place as well as how we educate young children aged birth to eight years. We?ll consider why policy makers, politicians, educators and parents view early education as important through an examination of the current status of American?s young children and their families and a review of the relevant research. . As students explore these issues we?ll also talk about what career options are available and what preparation is needed to become an early childhood educator.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40718\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197EDUC1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR1","x":3.0,"y":0.0,"id":"3","attributes":{"Title":"Orange is the new Black- 1","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR1\nUMass Amherst\nOn NPR, Piper Kerman pointed out that networks and publishers needed a white protagonist to tell the tales of Black women, Latina women, and old women and criminals she discovered in prison. In this seminar, we will use OITNB as a launch pad to discuss white privilege and its impact on meaningful `social work,? that include but are not limited to education, development, community service learning, and notions of `wanting to give back? in general. We will explore the structural inequities that OINB discusses, and examine issues of privilege and relatability as we apply it to complex questions about ways in which to engage collaboratively with communities both domestically and internationally to reverse inequities with responsibility & respect. The class will introduce participants to social theories of education, cultural studies, development studies, and critical psychology as we think more generally about engaging critically and responsibly with communities.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79653\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197LGL","x":4.0,"y":0.0,"id":"4","attributes":{"Title":"Human Trafficking and Modern D","Description":"Fall\n2015\nFaculty First Year Seminars\n197LGL1\nUMass Amherst\nThe phenomenon of human trafficking has gained widespread attention over the past decade .  At its heart, human trafficking is about exploitation of people who are unable to refuse or to leave a situation, whether they have been transported across borders or are exploited within their own country.  Exploitation comes in many forms and in many industries?sex, factories, fishing, domestic labor, begging to name a few?and affects men, women and children alike.  This course will explore, among other things, the different types of trafficking prevalent in the world today, the debates surrounding how to solve the problem and how it is represented in the mass media.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40465\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197LGL1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR3","x":5.0,"y":0.0,"id":"5","attributes":{"Title":"Orange is the new Black -3","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR3\nUMass Amherst\nThis is an opportunity to be engaged in discussing, reading, thinking through some pertinent themes, and contemporary issues linked to the `common read? Orange is the New Black. Spend this time part?nering with each other, and using your own competencies for critical engagement with the book. You will be delighted with the outcomes.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79655\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PHY","x":6.0,"y":0.0,"id":"6","attributes":{"Title":"Positive Psychology","Description":"Fall\n2015\nFaculty First Year Seminars\n197PHY1\nUMass Amherst\nPositive psychology is the study of well-being and flourishing. This course will teach concepts and practices backed by scientific research that students can apply directly to their lives in college and beyond. Methods of positive psychology can be applied to enhance professional accomplishment and personal happiness. Research also shows that people learn effectively and exhibit marked creativity in situations where there is substantial autonomy and real-world relevance. Coursework activities will center on personal application of the subject through action and reflection. Course topics include appreciative inquiry, intrinsic versus extrinsic motivation, fixed versus growth mindset, flow (engagement), creativity, the value of play, integrity, resilience (grit), gratitude, positivity boosters, mindfulness, observation, design thinking, innovation and resourcefulness, power of collaboration, and leadership. The research studies discussed in this course lightly introduce students to a variety of modern research methods.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40387\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197PHY1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR4","x":7.0,"y":0.0,"id":"7","attributes":{"Title":"Orange is the new Black - 4","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR4\nUMass Amherst\nAs any journal-keeper, or blogger, knows, writing can be a good way to work through major changes in your life.  And starting college is a major change!  For most of you, you?ll be leaving home for the first time in your life, moving into a dorm with hundreds of strangers, and beginning a phase of your education that will be more demanding, and more dependent on your own initiative, than ever before.  With Piper Kerman?s Orange is the New Black as inspiration, you?ll use writing to work your way through your first semester here: recording, describing, narrating, analyzing, interrogating, trouble-shooting, and communicating your experience for yourself and others.  We?ll do lots of writing, some reading, and a good bit of sharing.  You?ll not only produce a non-fiction record of your first semester here; you?ll get a good introduction to the intellectual and creative life of college itself.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79656\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR4/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ENW","x":8.0,"y":0.0,"id":"8","attributes":{"Title":"Fast Fiction","Description":"Spring\n2015\nFaculty First Year Seminars\n197ENWR\nUMass Amherst\nThis is an introductory 1-credit course for students with an interest in developing their abilities as fiction writers. Each week, students will read and discuss short stories that highlight a particular element of craft, such as character, setting, dialogue, and voice. Students will then have an opportunity to develop their writing skills in relation to the weekly topic through in-class writing exercises, discussion, and peer review of written work. Fast Fiction is for students with little to no experience as fiction writers who wish to explore the fundamentals of craft, write pieces that can later be developed into short stories or longer works, and engage in constructive conversation about writing with their peers. The semester will conclude with student readings/presentations.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19554\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197ENWR/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197POL","x":9.0,"y":0.0,"id":"9","attributes":{"Title":"Serial: Storytelling in Law an","Description":"Fall\n2015\nFaculty First Year Seminars\n197POL9\nUMass Amherst\nThe first season of the Serial podcast investigated the murder of a high school student, and the prosecution of her ex-boyfriend for the crime. Using the 12 episodes of the podcast as our springboard, this interdisciplinary course will explore the different ways in which events are remembered and portrayed ? by participants, witnesses, journalists, and lawyers. Each week, we?ll listen to an episode of the podcast, and read and discuss additional materials on memory, narrative theory, journalism, and trial practice. The course will also touch on the case?s intersections with domestic violence, race, religion, and gender.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40469\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197POL9/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PUB","x":10.0,"y":0.0,"id":"10","attributes":{"Title":"Socialism? Government Takeover","Description":"Fall\n2014\nFaculty First Year Seminars\n197PUBH5\nUMass Amherst\nBefore and after the Affordable Care Act (ACA) was passed in March 2010 there has been considerable debate about the new law.  Critics have described the ACA or ?Obamacare? as a ?government takeover of medicine?, creates ?death panels? for seniors, and undermines quality health care.  Opponents have characterized Obamacare as a failed policy.  However, supporters argue that the ACA improves access to quality health care, reduces the number of uninsured, maintains quality health care, and helps to reduce the national debt.  In this course, we will discuss and analyze the politics surrounding the passage and implementation of the ACA.   We will also go beyond the rhetoric by examining the substance of the legislation to discover how the ACA actually reforms the health care system. Finally, we will also discuss the future of the ACA and its impact on the American health care system.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79695\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197PUBH5/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197SOC","x":11.0,"y":0.0,"id":"11","attributes":{"Title":"Intro to the Asian Amer. Exper","Description":"Fall\n2015\nFaculty First Year Seminars\n197SOC2\nUMass Amherst\nThis course introduces students to the many histories, experiences, and cultures that shape and define the Asian American population.   Through developing and applying their `sociological imagination? -- a combination of theory, concepts, methods, and results of systematic and critical inquiry -- students will explore historical, demographic, political, economic, and cultural themes, patterns, and experiences related to the Asian American population.  \nA preliminary schedule of weekly topics include:   foundational concepts such as racial/ethnic inequality; patterns of immigration and settlement; assimilation and ethnic identity formation; racism and discrimination; the model minority image; interracial relationships; representation in media and popular culture; and social activism and political power.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40424\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197SOC2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PSI","x":12.0,"y":0.0,"id":"12","attributes":{"Title":"To Bee or Not to Bee: Honeybee","Description":"Fall\n2015\nFaculty First Year Seminars\n197PSIS3\nUMass Amherst\nThe dramatic decline in honeybees over the past several years related to Colony Collapse Disorder has raised the public's awareness to the importance of these insects in our everyday life. This seminar will use the popular book 'Fruitless Fall: The Collapse of the Honeybee and the Coming Agricultural Crisis' by Rowan Jacobsen as a guide to examine the importance of bees in our society, the possible causes of declining honeybee health, as well as learn more about the biology and social society of bees. Students in the course will have a chance to get 'up close and personnel with bees' with a trip to a local apiary, a lesson from a master beekeeper and an inside look into a beehive.  Rowan Jacobsen's book 'Fruitless Fall: The Collapse of the Honeybee and the Coming Agricultural Crisis' will be used as a guide for weekly seminar discussion.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40367\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197PSIS3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR6","x":13.0,"y":0.0,"id":"13","attributes":{"Title":"Orange is the new Black - 6","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR6\nUMass Amherst\nThis is a wonderful opportunity to use the Common Read book, Orange is the New Black, to explore the role that lawyers play in our criminal justice system.  \nI envision that we will begin the class by looking at how criminal statutes are enacted (with an emphasis on modern drug laws at the state and federal level and the role that lawyers play in policy development and the legislative process.)  Next, the class will explore the role of the lawyer at the arrest and bail stages, the plea bargain stage, the motions stage, and, finally, the trial stage of the criminal system.  The class will then look at the role lawyers play in the appeals process.  Last, the role that lawyers play in safeguarding incarcerated inmates will be examined.  The importance of advocacy in our system will be a primary focus, with opportunities for students to engage in various forms of advocacy.  Case Law, Statutes, and other legal sources will be utilized, as well as readings from literature, the social sciences, philosophy, and business.  Film excerpts will also be incorporated into the class.  This course will provide students with research and writing opportunities, along with instruction in the use of various communication technologies (allowing students to engage in hands on learning about website design, blogs, and social media.)\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79670\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR6/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR5","x":14.0,"y":0.0,"id":"14","attributes":{"Title":"Orange is the new Black - 5","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR5\nUMass Amherst\nThis class will place this year's Common Read selection, Piper Kerman?s Orange is the New Black, in the context of major works by US prison authors. To help the class consider in more depth how incarcerated US writers have represented their lived experience, throughout the semester I will provide short excerpts of work by prisoners including Angela Davis, Jean Harris, Kim Wozencraft, and Malcolm X that relate to our two central texts, Orange is the New Black and On the Yard (1967). Much of the semester will be spent reading Malcolm Braly?s classic prison novel On the Yard a few chapters at a time and discussing its treatment of topics including psychiatry, sexuality, mental illness, labor, social hierarchies, and the drug trade in prison in relation to Orange is the New Black. We will conclude by analyzing a few episodes of the TV series Orange is the New Black.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79657\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR5/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CHE","x":15.0,"y":0.0,"id":"15","attributes":{"Title":"How much Arsenic do we eat?","Description":"Fall\n2015\nFaculty First Year Seminars\n197CHEM\nUMass Amherst\nAn introduction to the ideas that we need protect ourselves from naturally occurring toxic chemical substances in our environment, and to deal responsibly with those chemical substances we deliberately distribute into the environment. In answering the question posed in the course title, we will learn how science advances by dissemination of research results in the peer-reviewed literature, several examples of which we will read. We will discover what arsenic compounds are in our food, how they got there, and whether they are potentially harmful. We will discuss the reasons why consumer advocacy groups are calling for regulations governing the concentrations of arsenic in food and in rice in particular. The key role of chemical analysis in providing reliable information for the various sciences involved in such studies will be examined, and the current capabilities of chemical measurement technologies will be critically evaluated.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40418\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197CHEM/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197RE1","x":16.0,"y":0.0,"id":"16","attributes":{"Title":"Nudge: Behavioral Economics fo","Description":"Fall\n2015\nFaculty First Year Seminars\n197RE1\nUMass Amherst\nThis course will be a discussion-based and cover some of the implications of behavioral economics for individual decision making and public policy. The topics will follow along with the book Nudge: Improving Decisions About Health, Wealth and Happiness by Richard H. Thaler and Cass R. Sunstein (2008, Yale University Press). I intend to cover the all of the sections on decision-making (Chapters 1-5, which include: Biases and Blunders, Resisting Temptation, Following the Herd, When do we need a Nudge), some of the sections on money (Chapters 6-8: Save more tomorrow, Naive investing, and credit markets), and health (Chapters 11-12: How to increase organ donations, saving the planet), and the sections on extensions and objections (Chaptrs 16-18: a dozen nudges, objections, and the third real way). This will allow the students to read one chapter a week and come in for a discussion of the material. Additionally, it will expose them to a number of the behavioral biases and `economic errors? in decision making and teach them how to avoid these pitfalls\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40419\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197RE1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197RP4","x":17.0,"y":0.0,"id":"17","attributes":{"Title":"Introduction to Sustainabilit","Description":"Fall\n2015\nFaculty First Year Seminars\n197RP4\nUMass Amherst\nThis interdisciplinary course will address the theory and practice of sustainability. Its primary goal is to introduce concepts and help students to develop a framework to better understand the challenges surrounding the transition towards sustainability, with regards to both human well-being and the protection of the environment. Class discussions will involve a broad range of topics related to global climate, ecosystems, quality of life, poverty and affluence, and provide a basic overview of the complexities involving social, ecological, political, cultural and economic goals. Students will become acquainted with different approaches and sub-disciplinary fields concerned with sustainability issues, as well as with the roles of scientists, practitioners, public involvement and decision-makers in transitioning towards sustainability. This course will utilize the compilation of published scholarly articles, edited by Robert Kates in 2010. PDF copies of additional readings will be available on the Moodle web site one week before each class.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40410\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197RP4/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ANM","x":18.0,"y":0.0,"id":"18","attributes":{"Title":"What?s in your genes?","Description":"Spring\n2015\nFaculty First Year Seminars\n197ANML3\nUMass Amherst\nDiscovery and development of  antibiotics and vaccines revolutionized healthcare in the 20th century and with it, changed the impact of once deadly infectious diseases. The 21st century marked the dawn of genomics which holds similar promise to revolutionize our understanding of health and disease. The course will discuss the tools used to understand what is coded in our DNA as well as how this genetic plan is modified throughout our lives by exposures that define the ?epigenetic? instructions --- the modifiable script in our DNA. Topics from recent news reports will be used to explore the impact of genetic testing and the promise for personalized medicine.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19759\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197ANML3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PHI","x":19.0,"y":0.0,"id":"19","attributes":{"Title":"Agency, Rationality and The Go","Description":"Fall\n2015\nFaculty First Year Seminars\n197PHIL3\nUMass Amherst\nWhat moves you to act? When are you responsible for what you do? Can we ever act against what we judge to be\nbest? Why should we do the right thing? Is doing the right thing against my own self-interest ? unless I get\ncaught doing wrong? We will explore Socrates? answers to these and other thorny questions that are central to the\nmeaning of our lives and yet so often taken for granted. Consider: what is it to live a good life? How do you\nknow if your life is successful? Is it to have health, wealth and power? Pleasure? Is it something you can control?\nDoes the good life include morality? We will read several of Plato?s dialogues and discuss Socrates? surprising\nviews about agency, rationality and the good life ? as counterintuitive for the ancient Greeks as they are for us\ntoday.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40435\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197PHIL3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197HIS","x":20.0,"y":0.0,"id":"20","attributes":{"Title":"Sport and Society: A Historica","Description":"Spring\n2015\nFaculty First Year Seminars\n197HIST12\nUMass Amherst\nThis First-Year Seminar will introduce students to debates about the ways professional and amateur sports are both shaped by and shape society.  We will read articles on the history of baseball, football, basketball, hockey, soccer, and the Olympics.  We will discuss sports as both entertainment and businesses, and analyze how issues in American society are often reflected in sports.  We will consider the question of whether or not sports lead the way in social change or lag it.  Students are required to complete all the assigned readings (one article per week) and prepare a short reaction paper (one to three paragraphs) for each week.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19555\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197HIST12/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197LLC","x":21.0,"y":0.0,"id":"21","attributes":{"Title":"Cog & Ling Strat to 2nd lang.","Description":"Fall\n2015\nFaculty First Year Seminars\n197LLC1\nUMass Amherst\nDo you have problems understanding  grammar explanations in foreign language classes? Would you like to be fluent in a foreign language but feel that you  need some extra help to get past the beginner level? If you want to streamline your language learning experience, and  learn some linguistic and cognitive strategies that will allow you to acquire a second language more easily, this seminar  can help you. We will explore some findings in second language acquisition research that can help you develop learning  strategies that go way beyond outdated flashcards. We will also look at universal properties of human language to  understand structural and lexical variations that make specific individual grammars different from one another. By the  end of the semester you will know the grammatical terminology used in language classes, and you will have developed new strategies to improve your ability to communicate in a second language.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40371\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197LLC1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CHC","x":22.0,"y":0.0,"id":"22","attributes":{"Title":"\"New\"Ways of Making Families:","Description":"Fall\n2014\nFaculty First Year Seminars\n197CHC1\nUMass Amherst\nWhile neither assisted reproduction nor adoption are entirely new, both have radically increased in recent decades, potentially transforming the face of the American family. No longer performed in secrecy nor limited to heterosexual couples, assisted reproduction methods such as sperm and egg donation, in vitro fertilization, and surrogacy have become increasingly sophisticated. Meanwhile the landscape of adoption has been redefined by transparency, the rise of transracial and international adoption, and the partial acceptance of single and same-sex adoptive parents. In this reading- and discussion-based course we will explore and debate ethical, psychological, and cultural issues arising from these \"new\" ways of making families.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79667\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CHC1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PSE","x":23.0,"y":0.0,"id":"23","attributes":{"Title":"Career and Happiness","Description":"Fall\n2015\nFaculty First Year Seminars\n197PSE1\nUMass Amherst\nA fulfilled career and lasting happiness require self knowledge ? how one understands his/her own values, desires, choices, and habits of dealing with self and others. Though vitally important, self knowledge is more difficult to obtain than knowledge about the outside world, as the former requires our eyes to look inward, which unfortunately is not one of our born habits. Using the concepts discussed in The 7 Habits of Highly Effective People, one of the most influential self-help books in history, this class will explore topics such as self awareness, values, interpersonal relationship, career, and happiness. These explorations help one to make conscious effort to elevate him/herself in negotiating with life challenges, uncovering passions and dreams, and becoming a positive contributing member of the society.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40415\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197PSE1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197GER","x":24.0,"y":0.0,"id":"24","attributes":{"Title":"Punk and American Undergrnd","Description":"Fall\n2015\nFaculty First Year Seminars\n197GER2\nUMass Amherst\nA study of the punk movement in the USA from the mid-1970s through the 1990s, which will introduce first-year students to critical theory and the study of popular culture. (See attached for bibliography and suggested weekly topics).\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40392\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197GER2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197MKT","x":25.0,"y":0.0,"id":"25","attributes":{"Title":"Addressing Global Poverty","Description":"Spring\n2015\nFaculty First Year Seminars\n197MKTG1\nUMass Amherst\nGlobally, approximately 3 billion people, 40% ofthe earth's inhabitants, live on less than US $3.00 per day. This course introduces students to the real ity of poverty and the \"bottom of the pyramid\". Students  are also presented with  narratives of poverty from individuals' lived experience, macro approaches to poverty reduction and business strategies to address poverty. The issues of interest are also reviewed in different environmental contexts to provide insight  into  the broad  diverse landscape  of global poverty.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19698\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197MKTG1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197KIN","x":26.0,"y":0.0,"id":"26","attributes":{"Title":"Neuroengineering and Rehabilit","Description":"Fall\n2015\nFaculty First Year Seminars\n197KIN1\nUMass Amherst\nThe human brain is an information processing system without parallel. It excels at identifying objects and carrying out actions in ways no current computer or robot can achieve. Neuroscientists are studying the neural mechanisms by which we feel, act, learn and remember. Recent research has generated a rapidly evolving field of high- profile discoveries. The new knowledge is critical for understanding normal brain processes, and has important implications for the rehabilitation of abnormal functioning after neurological damage (e.g., concussion, stroke). However, media attention has sometimes outstripped the limits of what current science can really tell us. This seminar aims to convey a clear sense of this field by focusing on current controversies regarding organization and function in the nervous system.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40373\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197KIN1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197BIO","x":27.0,"y":0.0,"id":"27","attributes":{"Title":"The Sex Lives of Animals","Description":"Fall\n2015\nFaculty First Year Seminars\n197BIO3\nUMass Amherst\nIn this seminar, we will explore the amazing diversity of animal mating and reproduction. We will investigate how animals find and select mates, how male and female sexual imperatives differ, the wide variety of means and methods by which animals reproduce, and more. We will also ponder some ?why? questions, such as ?Why do males and females differ??, ?Why are many sexual behaviors so extreme and elaborate??, and ?Why does sex exist??\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40346\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197BIO3/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197SOM","x":28.0,"y":0.0,"id":"28","attributes":{"Title":"Probability and Games of Chanc","Description":"Fall\n2015\nFaculty First Year Seminars\n197SOM2\nUMass Amherst\n?Probability and Games of Chance? will utilize classical statistics to analyze lotteries, roulette, black-jack, poker and other games of chance typically found in casinos around the world.  Probability theory has direct bearing on chances of success, and yet far too many choose to participate with little understanding of the risk/reward trade-off.  For example, one of the most popular games of chance is the lottery, and yet the payoff from most lottery games is significantly unfavorable to the player. \nSurveys of college students show great interest in games of chance, especially with the growth of casino gambling and on-line poker. While freshman do not typically enter UMass with a course in probability and statistics, the treatment in this class will assume little baseline knowledge such that it will be accessible to anyone with interest.  Students in this course will take away a realistic view of games of chance, skills that may benefit them throughout their life.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40431\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197SOM2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197GEO","x":29.0,"y":1.0,"id":"29","attributes":{"Title":"The Nature of Extinction: From","Description":"Fall\n2015\nFaculty First Year Seminars\n197GEO1\nUMass Amherst\nWe will explore the nature of mass extinctions over the Phanerozoic Eon, i.e., the last 542 million years. No two extinction events were alike. We will consider the types of evidence and hypotheses about the causes of extinction in the context of our planet?s dynamic history. We will explore several examples, and consider whether we are in the midst of a mass extinction today.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40455\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197GEO1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CEE","x":30.0,"y":0.0,"id":"30","attributes":{"Title":"The Janus Face of Nanotech.","Description":"Fall\n2015\nFaculty First Year Seminars\n197CEE1\nUMass Amherst\nNanotechnology can be a double-edged sword. The same unique properties that enable the beneficial use of nanomaterials in novel applications also make their unintentional interactions difficult to anticipate. Increasing entry of engineered nanomaterials into the environment has resulted in growing environmental and health concerns as the field of nanotechnology continues to expand. Nanomaterials are not only found in our latest gadgets, they are also\nubiquitous in the environment. Such natural nanomaterials influence important environmental processes such as the transport of contaminants. This seminar will explore a wide range of topics related to the applications and implications of natural and engineered nanomaterials. Students will learn about 1) what makes nanomaterials functional and safe/dangerous, 2) their potential human and ecosystem health effects, and 3) their beneficial use in various\ntechnologies.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40385\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197CEE1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197RP5","x":31.0,"y":0.0,"id":"31","attributes":{"Title":"Climate Change Adaptation","Description":"Fall\n2015\nFaculty First Year Seminars\n197RP5\nUMass Amherst\nClimate change will have a profound impact on our future cities, influencing new forms of infrastructure, systems and buildings. From rising sea levels to the increasing  frequency  and severity of natural disasters,  the environmental  impacts of climate change  have already begun to materialize. As people look for alternative ways to ensure stability and sustainability in the coming years, regenerative\ndesign appears to be a promising tool.\nThis class will unpack the issues that confront cities on the front lines of climate change, from food security and water access to energy, transportation and material resources. We will look at a number of different case studies to understand the types of design strategies and opportunities that are already underway. Beginning with examples of post-disaster rebuilding, to Utopian Communities, permaculture models, and finally a Himalayan village in the process of moving itself, these precedents offer fresh and hopeful solutions\nfor our floundering planet.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40409\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197RP5/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CIC","x":32.0,"y":0.0,"id":"32","attributes":{"Title":"Artificial Intelligence and So","Description":"Fall\n2015\nFaculty First Year Seminars\n197CIC1\nUMass Amherst\nHow is progress in artificial intelligence affecting society?  Artificial intelligence (AI) is fueling the development of autonomous systems that have already changed the way space exploration is conducted and is beginning to transform everyday life with a range of household products.  Such systems offer transformational impact on society as they help reduce human labor and risks, while improving productivity and efficiency.  Meanwhile, some scientists such as Stephen Hawking warn that thinking machines pose a threat to our very existence.  This class covers the major accomplishments of AI, what AI systems can do today and how they do it.  Students will explore the potential and limitations of AI, the impact of AI technology on society, and the ethical questions that are raised by these technological developments.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40464\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197CIC1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197EHS","x":33.0,"y":0.0,"id":"33","attributes":{"Title":"Misinformation in the Media: a","Description":"Fall\n2015\nFaculty First Year Seminars\n197EHS1\nUMass Amherst\nThis course explores the errors, inaccuracies, and appropriate portrayals of common principles of environmental health science.  Major films such as Erin Brockovich, The Day After Tomorrow, and  Outbreak are popular movies that were based on how science and environment interacts with human health.  This course takes a critical approach to how these topics are conveyed to an audience, explores the scientific principles and relevancy involved in environmental health topics, and evaluates proactive approaches we may take to ensure a complete understanding of environmental health topics in the mass media.   The focus of learning is not on artistic license; rather it is centered ensuring students employ critical thought and skepticism in what they see in popular media.  The course would cover one movie every two weeks (viewed outside of classroom, provided electronically at no cost), with meeting times including explanation of basic scientific principles, critical evaluation of how the science is presented, and how (or if) this differs from reality.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40428\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197EHS1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ENG","x":34.0,"y":0.0,"id":"34","attributes":{"Title":"The Linguistic Landscape of UM","Description":"Fall\n2015\nFaculty First Year Seminars\n197ENG6\nUMass Amherst\nLinguistic Landscape is an area of study in sociolinguistics that examines the language of building signs, graffiti, billboards, sidewalk chalk, and public advertising in city streetscapes, downtowns, and, in the case of this seminar, on college campuses. Languages are on display all over campus, although they often go unnoticed until they offend or incite (for example, with racist graffiti). This seminar explores the linguistic landscape of UMass Amherst, asking not just what languages are visible on campus, but what visible languages do or mean to the campus community. Throughout the seminar we will keep the following questions in mind and revisit them in discussion:\n? Who displays which languages, dialects, and accents where on campus? To what effect?\n? How do UMass students, instructors, and staff use the linguistic landscape to impress, disturb, make changes, or cause problems?\n? What does the linguistic landscape of campus say about UMass Amherst itself?\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40430\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197ENG6/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197COM","x":35.0,"y":0.0,"id":"35","attributes":{"Title":"Media, Fashion, Culture, Style","Description":"Spring\n2015\nFaculty First Year Seminars\n197COMM1\nUMass Amherst\nThis seminar will look at the use of clothing for communicative expression and cultural meaning, and the way it has been represented in the media. Our interdisciplinary approach will be informed mainly by cultural studies and film/media studies but will draw in other discourses and fields such as journalism, cultural anthropology, visual rhetoric/semiotics, gender and sexuality studies, performance theory, and design practices. Our main examples will include cinema, television, street-style and personal style blogs, fashion journalism, and advertisements. We will incorporate short readings, classroom discussion, several short writing exercises (cultural critiques), in-class interactive hands-on activities/presentations/projects, and a field trip.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n19550\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/SPRING/FFYS/197COMM1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CR2","x":36.0,"y":0.0,"id":"36","attributes":{"Title":"Orange is the new Black - 2","Description":"Fall\n2014\nFaculty First Year Seminars\n197CR2\nUMass Amherst\nThe Pioneer Valley is a hotbed for prison abolition activism -- a movement that seeks not only to improve conditions for prisoners but to dismantle the ?prison-industrial complex? that many argue continues the legacy of slavery and Jim Crow. In this course, we will analyze writings, hip-hop music, and art produced by prisoners and prison abolitionists, discuss their perspectives on race, class, gender, and sexuality in the prison system, and debate their tactics. The format will break down the walls and hierarchies of a traditional classroom experience: we will regularly bring in activists from local grassroots organizations, and the instructor will collaborate with an advanced undergraduate student activist to facilitate class discussions based on an anti-hierarchical model of community organizing. The course will thus provide opportunities to learn not only about prisons, but also about how faculty, students, and community can work together on issues that concern us all.\nFreshmen Only\nPermission is required for interchange registration during all registration periods.\n79654\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197CR2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ESL","x":37.0,"y":0.0,"id":"37","attributes":{"Title":"Negotiatin Cultr in Globl Locl","Description":"Fall\n2015\nFaculty First Year Seminars\n197ESL1\nUMass Amherst\nWith today?s emphasis on globalization, many students have become interested in learning about culture and cultural diversity, thereby enhancing their understanding of their own cultural heritages and that of others. The course examines the unifying fabric of American culture, comprising socio-cultural values, attitudes, and traditions. To help students develop their intercultural competency for global contexts, the course offers units on the diversity of ethnicities, race, and religions that represent contemporary global worldviews; gender roles; and the issue of stereotyping. The course also offers a number of useful strategies to help students adjust to the local university culture. Included are practical strategies for improving oral communication skills; enhancing the development of critical-thinking skills; and writing and reading more effectively in the academic register, all of which are necessary for successful professional work in local and global contexts.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40341\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197ESL1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197THE","x":38.0,"y":0.0,"id":"38","attributes":{"Title":"WHITE LINES: Whiteness, Privil","Description":"Fall\n2015\nFaculty First Year Seminars\n197THEA6\nUMass Amherst\nThis course engages students in an exploration of the multi-dimensional nature of race in contemporary culture by focusing on the performance of whiteness. Involving a constant public presentation, or staging, whiteness is\nmaintained through its reiterated and stylized performance. In this course, we will unpack what whiteness (the racial category and the lived experience) is, and explore how whiteness functions in our contemporary society. We will explore its invisibility and ubiquity in popular culture, its power dynamics, and the way in which whiteness gets performed in personal and public life. Using examples from various cultures?American, Canadian, British and South\nAfrican?we will ask the following kinds of questions: What makes someone ?white?? How has whiteness come to be the default category of existence? Why can we see people of color as raced bodies and yet whiteness is an invisible default? How is whiteness part of (or the center of) a system of institutional and cultural privilege? What are the stakes, burdens, benefits, and pitfalls of being white? Not white? How might one perform ?ethically? as a white person?\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40722\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197THEA6/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ART","x":39.0,"y":0.0,"id":"39","attributes":{"Title":"Design Drawing","Description":"Fall\n2014\nFaculty First Year Seminars\n197ART6\nUMass Amherst\nThis course will introduce students to fundamental \"design thinking\" and graphic communication skills in architecture.\nStudents will gain an understanding of drawing as a vital means to see, analyze, and represent essential aspects of the\nvisual environment. Emphasis will be placed on freehand drawing and sketching, using UMass buildings as case\nstudies.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n79674\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2014/FALL/FFYS/197ART6/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ECO","x":40.0,"y":0.0,"id":"40","attributes":{"Title":"Trees & Sustainability","Description":"Fall\n2015\nFaculty First Year Seminars\n197ECO1\nUMass Amherst\nIt's estimated that 80% of the U.S. population lives in cities and towns, and the trend is expected to continue into the foreseeable future. Increasing population in urban and suburban areas increases the demand on the infrastructure of such places to sustain the residents. Trees are an integral part of the infrastructure, providing many environmental, economic, and social benefits; they make it easier for us to live sustainably. This is why so many communities (like Boston, New York, Washington DC and others) have started to plant more trees. It sounds simple:  plant more trees and things will be fine. But there?s more to it:  in order to realize the benefits that trees can provide, you have to plan and maintain the ?urban forest?. We will discuss how best to do so in this course.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40414\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197ECO1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197CL1","x":41.0,"y":0.0,"id":"41","attributes":{"Title":"Art, Culture, & Literature @UM","Description":"Fall\n2015\nFaculty First Year Seminars\n197CL1\nUMass Amherst\nThe UMass area has attracted visitors and residents since the 19th century with its cultural riches, including nature mediated through art and culture. The seminar will look at history and contemporary artists, writers, businesses, and institutions that foster and contribute to this, beginning with 19th century tourism and extending to the fine and popular arts and artists today and in recent decades. The course will include consideration of painting and sculpture, writing including fantasy and children's literature, illustration, nonfiction writing, and animation. The course may include guest speakers, and one or more field trips, if possible.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40368\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197CL1/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197JRN","x":42.0,"y":0.0,"id":"42","attributes":{"Title":"Martha?s Vineyard in NE Imagin","Description":"Fall\n2015\nFaculty First Year Seminars\n197JRN2\nUMass Amherst\nLike all islands, Martha?s Vineyard is a head case, mysterious, a unique coinage, cut off, stuck-up, a loner, a bit of a drama queen. Until the 1960?s, it was a well-kept secret, an inconvenient add-on to Cape Cod, an acquired taste for people with an antisocial streak because the island such a pain to get to: who wanted to take a ferry ---- all that waiting and all that bother ---- when you could simply drive down Route Six and find yourself in Truro or Wellfleet or Provincetown. All that changed with Chappaquiddick, JAWS, and Presidents on vacation (Clinton and Obama.) In this class we will deconstruct the island on film, in literature and journalism, and in art.  The following people and places and things may not be familiar now but they will be by the end of our explorations: Illumination Night, Menemsha Harbor, the Striped Bass Derby, Circuit Avenue, Inkwell, Ice House Pond, Larsen?s Carly Simon, James Taylor, Kay Graham, Jackie Kennedy, The Hot Tin Roof, Humphreys?, William and Rose Styron, Walter Cronkite, Art Buchwald, Lillian Hellman, Allison Shaw, Jabberwocky and Impossible Dreams.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40331\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197JRN2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ANT","x":43.0,"y":0.0,"id":"43","attributes":{"Title":"Culture, Community & Language","Description":"Fall\n2015\nFaculty First Year Seminars\n197ANTH2\nUMass Amherst\nThis course will examine the relationship between language, community, and culture.  The human body evolved, adapting to the use of language for communication. The intimate relationships between culture, community, and language reveal a culture?s  worldview, community system, values, identity, and much more.  Colonization, commercial expansion, and digital technologies have impacted communities and their languages and cultures.  This course will introduce students to the concepts of culture, community and the integration of language within cultural systems.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40393\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197ANTH2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197ECE","x":44.0,"y":0.0,"id":"44","attributes":{"Title":"Applying Chance & Risk to Life","Description":"Fall\n2015\nFaculty First Year Seminars\n197ECE2\nUMass Amherst\nRandomness and uncertainty exist in our daily lives as well as in every scientific investigation. This course helps students better understand randomness and uncertainty and gives them tools to make more informed decisions under uncertain situations.  \nWe will discuss that our intuition is often wrong when assessing uncertain situations, leading us to make wrong decisions. We will provide real life examples where even professionals have misjudged chances and probabilities. \nWe will then go on to learn tools that are useful when we are faced with uncertainty. In doing so, we will briefly cover some topics in probability, information theory, and decision theory.  Without going into the details of these fascinating fields, our goal is to learn some key concepts and useful ideas that can be used broadly in uncertain situations. Along the way we will tackle examples from everyday decisions, personal finance and investing, economics, sports, big data, and gambling.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40413\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197ECE2/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197NRS","x":45.0,"y":0.0,"id":"45","attributes":{"Title":"Your Brain on Drugs","Description":"Fall\n2015\nFaculty First Year Seminars\n197NRSG\nUMass Amherst\nThis seminar will explore the lived experience of substance abuse and reflections on rehabilitation.  Additional sources of information will come from media accounts of a famous author/substance abuser and scientific reports of the neurophysiologic basis of addiction.   Understandings of the physical and emotional aspects of addiction including socially acceptable and unacceptable addictions will be explored.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40416\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197NRSG/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-197PSY","x":46.0,"y":0.0,"id":"46","attributes":{"Title":"The Science of prediction","Description":"Fall\n2015\nFaculty First Year Seminars\n197PSY10\nUMass Amherst\nIn this class we willread the book \"The Signal and the Noise:  Why So Many Predictions Fail ? But Some Don?t?\" by Nate Silver,  who is well known for predicting political elections and sports outcomes with great accuracy.  The book explains how careful use of data can lead to better predictions in many areas, including many areas of everyday life.  The only requirements for the class are attendance and participation in class discussions.\nFreshmen Only\nPermission is required for interchange registration during the add/drop period only.\n40468\n \n ","Department Code":"FFYS","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/UM/2015/FALL/FFYS/197PSY10/01'> Course Site </a>","Requisite":[]},"color":"rgb(88, 105, 178)","size":10.0},{"label":"FFYS-542","x":29.0,"y":0.0,"id":"47","attributes":{"Title":"FFYS-542","Description":"not offered in the last 4 semesters","Department Code":"FFYS","Course Site":"","Requisite":""},"color":"rgb(88, 105, 178)","size":10.0}]}