{"nodes":[{"label":[0,"HONORS-195KH"],"x":0.0,"y":1.0,"id":"(0, 'HONORS-195KH')","attributes":{"Title":"Community Engagement Seminar","Description":"Spring\n2016\nHonors College\n195KH\nUMass Amherst\nThis seminar is the first of three courses in the Sophomores-Serve program and introduces students to concepts and skills that prepare them to engage effectively with the local community. Topics include inquiry into the meanings of the social identities we each carry, practice in the skill of dialogue with people whose perspectives and life experiences differ from our own, and beginning discussions on leadership, citizenship, and social justice.\nThis course will meet for three workshops, Friday, February 5; 2:30pm-5:30pm; Saturday, February 20 (snow date will be Feb 27), and Friday, April 8; 2:30pm-5:30pm; for more information or to apply for this course go to https://www.honors.umass.edu/sophomores-serve.\nPermission is required for interchange registration during all registration periods.\n70708\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/195KH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[1,"HONORS-191FPH"],"x":1.0,"y":1.0,"id":"(1, 'HONORS-191FPH')","attributes":{"Title":"GW-Front Page I","Description":"Fall\n2015\nHonors College\n191FPH\nUMass Amherst\nPurpose: An opportunity to discuss current state, national, and global issues and events with talented faculty, distinguished community members, politicians, and influential alums. Class time will be devoted to vibrant and challenging discussions based on critical reading and analysis of newspaper articles on current issues Requirements: Reading the front page stories from the New York Times and the Boston Globe daily. Supplemental reading as needed. Objective: Training students as opinion leaders; to encourage them to be steadily engaged in the social, political and economic concerns of their time; to provide a context for interaction with experts and significant community members, and prepare them with verbal skills that are important in interviews for scholarships, graduate and professional schools, and employment.\nOpen to students in the Leaderships Honors RAP in Sycamore Hall.\nPermission is required for interchange registration during the add/drop period only.\n36923\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/191FPH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[2,"HONORS-221H"],"x":2.0,"y":1.0,"id":"(2, 'HONORS-221H')","attributes":{"Title":"The Springfield Renaissance","Description":"Spring\n2016\nHonors College\n221H\nUMass Amherst\nThis course uses the arts as a lens to study various historical sites in downtown Springfield and introduces students to the history of art in Springfield and its impact on the community. (No previous art experience necessary.)\nFive field trips to Springfield will be held, and students will be expected to participate in four of the five.  The field trip schedule will be arranged to accommodate student schedules and shuttle transportation will be provided.\nThe class examines the practical applications of art in relation to history, society, museum and gallery studies, culture and personal expression. Through field trips, guest speakers, written assignments, guided art-making activities in Studio 9, and a final art exhibition at 1350 Gallery, students will gain an overview of the development of Springfield's identity through art. Field trips include visits to four historic art sites in downtown Springfield, each followed by a two-page written assignment in which students interpret and analyze the experience. There will be a final five-page written assignment based upon art and its impact on society, especially in Springfield. Each of the experiences will also be interpreted though art-making activities in Springfield's Studio 9. A shuttle to Studio 9 and back to the Haigis Mall will be provided each Friday. By a guided analysis of the artists' ability to change the quality of life in the urban environment, students will develop their own understandings of what art means to them and how they think it contributes to society. Through painting/drawing sessions, guided site visits, guest lectures and a final art reception, students will experience what it takes to make art and the need for its presence in society.\nPermission is required for interchange registration during the add/drop period only.\n66890\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/221H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[3,"HONORS-195J"],"x":3.0,"y":1.0,"id":"(3, 'HONORS-195J')","attributes":{"Title":"GW-VeteranScholars:Transitions","Description":"Spring\n2015\nHonors College\n195J\nUMass Amherst\nVeteran Scholars is a tailored course for veterans and military service members joining the UMass community as students.  The purpose of the course is two-fold: first, the course is a first exposure to the small class size and quality instruction available to students who join the Commonwealth Honors College; second, the course picks up where the TAP program ends and serves as a transition medium for veterans reintegrating into civilian society.  Theoretical and practical application coursework will help veterans maximize their educational experience at UMass-Amherst.  This course meets twice weekly for the first seven weeks of the semester.\nPermission is required for interchange registration during the add/drop period only.\n19122\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/195J/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[4,"HONORS-396"],"x":20.0,"y":1.0,"id":"(4, 'HONORS-396')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2015\nHonors College\n396\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16292\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/396/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[5,"HONORS-499C"],"x":35.0,"y":1.0,"id":"(5, 'HONORS-499C')","attributes":{"Title":"Honors Thesis Seminar-1st Sem","Description":"Fall\n2015\nHonors College\n499C\nUMass Amherst\nNot available at this time\nThis course is open to Senior Commonwealth College students only.   Section Title: Bioterrorism: Interdisciplinary Perspective on International, Political and Scientific Challeneges.\nRegistration requires permission of the instructor. To enroll contact: Prof. Paula Stamps: stamps@schoolph.umass.edu\nPermission is required for interchange registration during all registration periods.\n36868\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/499C/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[6,"HONORS-196RIS"],"x":36.0,"y":0.0,"id":"(6, 'HONORS-196RIS')","attributes":{"Title":"Honrs Independent Study Option","Description":"Spring\n2016\nHonors College\n196RISH\nUMass Amherst\nVaries from 1 to 2 credits\nPermission is required for interchange registration during all registration periods.\n69638\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/196RISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[7,"HONORS-451"],"x":6.5,"y":3.0,"id":"(7, 'HONORS-451')","attributes":{"Title":"Cross-Cultural ReEntry Seminar","Description":"Fall\n2014\nHonors College\n451\nUMass Amherst\nThis re-entry seminar encourages returning ISP seniors to reflect on their experiences abroad.  It explores a number of cross-cultural issues in light of the seminar's collective experience.  Cultural relativism and the challenges of cross-cultural ethical judgement, the construction of personal and national identities, the understanding and portrayal of people from cultures other than one's own, the promises and problems of globalization are some of the issues considered.  Each student in the seminar completes a final project that brings together an experiential and an academic component.\nPre Req: HONORS 251 and 252  International Scholars Program Students Only\nPermission is required for interchange registration during all registration periods.\n76282\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/451/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[8,"HONORS-499D"],"x":37.0,"y":1.0,"id":"(8, 'HONORS-499D')","attributes":{"Title":"Honors Thesis Seminar -2ndSem","Description":"Spring\n2016\nHonors College\n499D\nUMass Amherst\nTopic Title- Bioterrorism: Interdiciplinary Perspective on International, Political and Scientific Challenges\nTaught by Paula Stamps\nRegistration requires permission of instructor.  To enroll contact: Prof. Stamps: stamps@schoolph.umass.edu\nPermission is required for interchange registration during all registration periods.\n70737\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/499D/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[9,"HONORS-499O"],"x":38.5,"y":2.0,"id":"(9, 'HONORS-499O')","attributes":{"Title":"Honors Project Seminar","Description":"Spring\n2016\nHonors College\n499O\nUMass Amherst\nCourse description not available at this time.\nSection prerequisite HONORS 499N section 2\nPermission is required for interchange registration during all registration periods.\n62900\n66892\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/499O/02'> Course Site </a>","Requisite":["Section prerequisite HONORS 499N section 2"]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[10,"HONORS-398"],"x":21.0,"y":1.0,"id":"(10, 'HONORS-398')","attributes":{"Title":"Practicum","Description":"Spring\n2015\nHonors College\n398\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16359\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/398/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[11,"HONORS-321H"],"x":40.0,"y":1.0,"id":"(11, 'HONORS-321H')","attributes":{"Title":"Violence in American Culture","Description":"Spring\n2016\nHonors College\n321H\nUMass Amherst\nThis course will explore the complex social and cultural interactions that can lead to violence. We will begin by examining various theories of human violence from a number of disciplines: anthropology, psychology, and sociology. Students will then survey different cultural attitudes towards violence beginning with several prehistoric sites from the American Southwest and northern Mexico. Next, the course will consider the historical roots of American violence starting with the European invasion of North America. Specific instances of violence in American history will also be considered, including the attempted genocide of American Indians, the enslavement of African Americans, and the American Civil War. The second half of the course will focus on a number of contemporary issues of American violence including race violence, hate crimes, violence against women, family violence, gang violence, and the violence in contemporary art and film. (Gen.Ed. SB, U)\nThis course is open to Senior, Junior, and Sophmore Commonwealth College students only.\nPermission is required for interchange registration during the add/drop period only.\n66803\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/321H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[12,"HONORS-499Y"],"x":41.0,"y":1.0,"id":"(12, 'HONORS-499Y')","attributes":{"Title":"Honors Research","Description":"Spring\n2016\nHonors College\n499Y\nUMass Amherst\nThe Commonwealth Honors College thesis or project is intended to provide students with the opportunity to work closely with faculty members to define and carry out in-depth research or creative endeavors.  It provides excellent preparation for students who intend to continue their education through graduate study or begin their professional careers. The student works closely with their 499Y Honors Research sponsor to pursue research on a topic or question of special interest to them in preparation for writing a 499T Honors Thesis or completing a 499P Honors Project.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for Honors Research to prepare for the completion of an Honors Thesis (499T) or an Honors Project (499P) must complete a contract proposal with their faculty chair using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their chair and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66801\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/499Y/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[13,"HONORS-198H"],"x":27.0,"y":1.0,"id":"(13, 'HONORS-198H')","attributes":{"Title":"Practicum","Description":"Spring\n2016\nHonors College\n198H\nUMass Amherst\nStudents registering for this Honors Practicum must complete a contract with their honors sponsor. Appropriate forms and more information are available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.\nStudents must apply through CHC PATHS to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66794\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/198H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[14,"HONORS-291A"],"x":44.0,"y":1.0,"id":"(14, 'HONORS-291A')","attributes":{"Title":"HonSem1:Ideas/ChangeTheWorld","Description":"Fall\n2014\nHonors College\n291A\nUMass Amherst\nIn this seminar, students will examine texts and works of art that have profoundly shaped the world we live in. The course is divided into four units: Models of Inquiry; the Impact of Science and Technology; Social Philosophy and Civic Engagement; and Art in the World. The course is supplemented with several plenary lectures by distinguished honors faculty speakers.\nOpen to Commonwealth Honors College Students only.\nPermission is required for interchange registration during the add/drop period only.\n76291\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/291A/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[15,"HONORS-496ISH"],"x":29.5,"y":1.0,"id":"(15, 'HONORS-496ISH')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2016\nHonors College\n496ISH\nUMass Amherst\nThis is a stand-alone independent study designed by the student and faculty sponsor that involves frequent interaction between instructor and student. The student and sponsoring instructor must fill out a contract, which is available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.  Qualitative and quantitative enrichment must be evident on the proposed contract before consent is given to undertake the study.  Submission can be done during pre-registration and should be done so that registration can be completed by the end of the add-drop period.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Independent Study must complete a contract with their faculty sponsor using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their sponsor and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. The 1-2 credit option is an additional component tied to any University course of at least 3 credits at the 400 level, with course instructor approval. The 3-6 credit option is a stand-alone independent study designed by the student and faculty sponsor. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66798\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/496ISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[16,"HONORS-195G"],"x":45.0,"y":1.0,"id":"(16, 'HONORS-195G')","attributes":{"Title":"GW-Intersections of Creativity","Description":"Fall\n2014\nHonors College\n195G\nUMass Amherst\nWhat does it mean to be a working artist? This seminar will take up this question by exploring the ways different kinds of artists (writers, visual artists, musicians, film-makers) work. We will examine the various creative processes artists use to create, explore the impulses and reasons behind artistic choices, attempt to determine where \"inspiration'' comes from, and discuss the ethical questions artists can face. We will begin the seminar with background readings to give us a theoretical grounding in creativity. We will then bring working artists into our seminar through guest speakers, pod-cast interviews, attending readings, performances, and films to further explore how artists work. As a way to explore these areas for themselves, throughout the semester students will develop their own \"artist books\" consisting of creative and academic responses to the readings and artists we encounter and the questions we raise.\nOpen to Freshman Commonwealth College students only.\nPermission is required for interchange registration during the add/drop period only.\n76349\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/195G/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[17,"HONORS-391AHH"],"x":46.0,"y":1.0,"id":"(17, 'HONORS-391AHH')","attributes":{"Title":"Honors Sem 2: Topics (colloq)","Description":"Spring\n2016\nHonors College\n391AHH\nUMass Amherst\nThis seminar is a required course for Commonwealth Honors College students where students participate in a topical seminar-style course designed by its instructor.  While the subject matter of each section is different, advanced knowledge of the topic is not required. While the subject matter of each section is different, the requirements for each section are the same. In this colloquium, students will engage deeply with material they have already encountered in the regular section of the course through further readings, conversation, and group work.\nOpen to Senior, Junior and Sophomore Commonwealth Honors College students only.\nPermission is required for interchange registration during the add/drop period only.\n66839\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/391AHH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[18,"HONORS-496RIS"],"x":47.0,"y":0.0,"id":"(18, 'HONORS-496RIS')","attributes":{"Title":"Honrs Independent Study Option","Description":"Spring\n2016\nHonors College\n496RISH\nUMass Amherst\nVaries from 1 to 2 credits\nPermission is required for interchange registration during all registration periods.\n69641\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/496RISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[19,"HONORS-496"],"x":28.0,"y":1.0,"id":"(19, 'HONORS-496')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2015\nHonors College\n496\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16293\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/496/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[20,"HONORS-298I"],"x":14.0,"y":1.0,"id":"(20, 'HONORS-298I')","attributes":{"Title":"Honors Advising Assistant Prac","Description":"Spring\n2015\nHonors College\n298I\nUMass Amherst\nCourse description not available at this time.\nThis course is open to Commonwealth Honors College students only.   Students must complete an application obtained at the Bloom Honors Advising Center, 201 Commonwealth Honors College Building.\nPermission is required for interchange registration during all registration periods.\n16428\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/298I/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[21,"HONORS-297DH"],"x":18.5,"y":1.0,"id":"(21, 'HONORS-297DH')","attributes":{"Title":"ST-Intro/New Media Production","Description":"Spring\n2016\nHonors College\n297DH\nUMass Amherst\nThis class will teach students the skills necessary to produce, disseminate, publicize, and monetize textual, audio, and video programs on the Internet. These skills include, designing new media programs; writing, recording, and editing new media programs; uploading, storing, serving, and backing up new media programs; software platforms for hosting new media programs; building audiences using social media; tracking audience size and behavior; and creating income streams with new media programs.\nStudents will apply what they learn by creating new media programs on the New Books Network (http://newbooksnetwork.com), a non-profit network of 100 author-interview podcasts. They will edit, compose, upload, publicize, and measure reach of interviews conducted by NBN hosts. As a final project, students will record and produce their own interviews. No prior knowledge of new media production is necessary.\nPermission is required for interchange registration during the add/drop period only.\n66913\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/297DH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[22,"HONORS-498H"],"x":6.0,"y":1.0,"id":"(22, 'HONORS-498H')","attributes":{"Title":"Practicum","Description":"Spring\n2016\nHonors College\n498H\nUMass Amherst\nStudents registering for this Honors Practicum must complete a contract with their honors sponsor. Appropriate forms and more information are available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.\nStudents must apply through CHC PATHS to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66853\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/498H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[23,"HONORS-195C"],"x":48.0,"y":1.0,"id":"(23, 'HONORS-195C')","attributes":{"Title":"GW-Emerging Scholars Seminar","Description":"Fall\n2014\nHonors College\n195C\nUMass Amherst\nThis one-credit seminar is designed to assist the Emerging Scholars students\nwith their academic transition to the University of Massachusetts. It was designed to connect students to campus resources including the Commonwealth College.\nOpen to students in the Emerging Scholars Honors HLC program only.\nPermission is required for interchange registration during the add/drop period only.\n76281\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/195C/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[24,"HONORS-499L"],"x":7.5,"y":3.0,"id":"(24, 'HONORS-499L')","attributes":{"Title":"International Thesis Seminar","Description":"Fall\n2015\nHonors College\n499L\nUMass Amherst\nCourse description not available at this time.\nHONORS 252  Students will meet either in smaller work groups on Thursday at 4:00pm and on Friday at 10:10am. Groups to be determined during the regular class time.\nPermission is required for interchange registration during all registration periods.\n36871\n36951\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/499L/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[25,"HONORS-252"],"x":7.0,"y":2.0,"id":"(25, 'HONORS-252')","attributes":{"Title":"Cross Cultural Prep Seminar","Description":"Spring\n2015\nHonors College\n252\nUMass Amherst\nThis intercultural communication seminar is designed to help students who are enrolled in the International Scholars Program prepare for their study abroad experience.  It explores the role that culture plays as a medium of communication.  It encourages students to see themselves as members of one or more cultural group and to anticipate what it will be like living, working and communicating in a new cultural environment.  (GenEd. SB, G)\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course PreReq: HONORS 251\nPermission is required for interchange registration during the add/drop period only.\n16298\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/252/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[26,"HONORS-495BH"],"x":49.0,"y":1.0,"id":"(26, 'HONORS-495BH')","attributes":{"Title":"GW-Front Page II","Description":"Spring\n2016\nHonors College\n495BH\nUMass Amherst\nThis course engages students in reading domestic and international news outlets and reflecting upon and discussing contemporary issues. Students from all majors are welcome, as the principal prerequisite is an interest in learning more about current events in the US and around the world and discussions with your peers. Front Page has two main goals: to engage students in learning and thinking critically about contemporary events, and to develop your capacity to speak effectively in group settings.  This is an informal, student-centered class: student run the discussions, do most of the talking, and share different perspectives. All serious perspectives are welcomed. Readings include the online version of the New York Times and one international news outlet of your choice.\nOpen to Commonwealth Honors College Students only.\nPermission is required for interchange registration during the add/drop period only.\n66835\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/495BH/01'> Course Site </a>","Requisite":["This course engages students in reading domestic and international news outlets and reflecting upon and discussing contemporary issues. Students from all majors are welcome, as the principal prerequisite is an interest in learning more about current events in the US and around the world and discussions with your peers. Front Page has two main goals: to engage students in learning and thinking critically about contemporary events, and to develop your capacity to speak effectively in group settings.  This is an informal, student-centered class: student run the discussions, do most of the talking, and share different perspectives. All serious perspectives are welcomed. Readings include the online version of the New York Times and one international news outlet of your choice."]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[27,"HONORS-495M"],"x":50.0,"y":1.0,"id":"(27, 'HONORS-495M')","attributes":{"Title":"GW-Introvert/Extrovert","Description":"Fall\n2014\nHonors College\n495M\nUMass Amherst\nOne's inner life and one's interactions with others are often affected by tendencies towards being an introvert or an extravert. Using readings from papers and the book Quiet... by Susan Cain, we will explore and discuss how such proclivities from childhood to college and beyond could help us in the roles that we wish to achieve. How do the strengths and weaknesses of such traits inform our leadership abilities now and in the future? Are there ways of changing one's own behaviors to maximize success?\nSr & Jr COMCOL SOCIOL majors\nPermission is required for interchange registration during the add/drop period only.\n79343\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/495M/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[28,"HONORS-499N"],"x":39.0,"y":1.0,"id":"(28, 'HONORS-499N')","attributes":{"Title":"Honors Project Seminar-1st Sem","Description":"Fall\n2015\nHonors College\n499N\nUMass Amherst\nCourse description not available at this time.\nThis course is open to Senior Commonwealth College students only.   Section Title: Truth/Telling: Reading and Writing Narrative Nonfiction - 1st Semester\nPreference in registration given to Commonwealth Honors College Seniors using this course toward their Capstone Experience requirement; others as space permits.\nContact Connie Griffin cgriffin@uww.umass.edu to enroll in this class\nPermission is required for interchange registration during all registration periods.\n32930\n36927\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/499N/02'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[29,"HONORS-296RIS"],"x":51.0,"y":0.0,"id":"(29, 'HONORS-296RIS')","attributes":{"Title":"Honrs Independent Study Option","Description":"Spring\n2016\nHonors College\n296RISH\nUMass Amherst\nVaries from 1 to 2 credits\nPermission is required for interchange registration during all registration periods.\n69639\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/296RISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[30,"HONORS-397C"],"x":52.0,"y":1.0,"id":"(30, 'HONORS-397C')","attributes":{"Title":"ST-Law in Action","Description":"Spring\n2015\nHonors College\n397C\nUMass Amherst\nThis course will examine how lawyers, social activists, and everyday people have used litigation to change the social and legal landscape in the post-war United States. Through reading numerous in-depth case studies of seminal civil and criminal cases, we will explore such questions as: How and why have social movements used \"the law\" to advance their causes? What are the pros and cons of using litigation to achieve social change (or right a wrong), versus other tools such as direct action, lobbying, and community organizing? How have lawyers constrained or expanded the vision of social justice movements? What dilemmas do lawyers--who are ethically bound to zealously advocate for the interests of individual clients--face when they are additionally interested in advancing \"a cause\"? How effective is litigation in actually achieving the goals originally envisioned by lawyers, activists, and litigants? Cases explored may include issues such as civil rights, women's rights, free speech, GLBT rights, disability rights, environmental justice, criminal justice, poverty lawyering, immigration rights, and the rise of conservative social movement lawyering.\nJunior and Senior Commonwealth Honors College Students, others by permission of the Instructor.\nPermission is required for interchange registration during the add/drop period only.\n18017\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/397C/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[31,"HONORS-296"],"x":34.0,"y":1.0,"id":"(31, 'HONORS-296')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2015\nHonors College\n296\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16283\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/296/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[32,"HONORS-201H"],"x":53.0,"y":1.0,"id":"(32, 'HONORS-201H')","attributes":{"Title":"Ideas That Change the World","Description":"Spring\n2016\nHonors College\n201H\nUMass Amherst\nIn this seminar, students will examine texts and works of art that have profoundly shaped the world we live in. The course is divided into four units: Models of Inquiry; the Impact of Science and Technology; Social Philosophy and Civic Engagement; and Art in the World. The course is supplemented with several plenary lectures by distinguished honors faculty speakers.\nOpen to students in the Emerging Scholars Honors HLC program only.\nPermission is required for interchange registration during the add/drop period only.\n66807\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/201H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[33,"HONORS-251"],"x":9.0,"y":1.0,"id":"(33, 'HONORS-251')","attributes":{"Title":"International Issues","Description":"Fall\n2014\nHonors College\n251\nUMass Amherst\nThis is the required entry course for students accepted into the International Scholars Program.  Its purpose is to provide students who are intending to study abroad with some of the significant concepts they will need in order to understand the international and national politics of the country where they plan to study.  Prerequisite: acceptance to ISP program. (GenEd. SB, G)\nInternational Scholars Program students only.\nPermission is required for interchange registration during all registration periods.\n76255\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/251/01'> Course Site </a>","Requisite":["This is the required entry course for students accepted into the International Scholars Program.  Its purpose is to provide students who are intending to study abroad with some of the significant concepts they will need in order to understand the international and national politics of the country where they plan to study.  Prerequisite: acceptance to ISP program. (GenEd. SB, G)"]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[34,"HONORS-396ISH"],"x":23.5,"y":1.0,"id":"(34, 'HONORS-396ISH')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2016\nHonors College\n396ISH\nUMass Amherst\nThis is a stand-alone independent study designed by the student and faculty sponsor that involves frequent interaction between instructor and student. The student and sponsoring instructor must fill out a contract, which is available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.  Qualitative and quantitative enrichment must be evident on the proposed contract before consent is given to undertake the study.  Submission can be done during pre-registration and should be done so that registration can be completed by the end of the add-drop period.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Independent Study must complete a contract with their faculty sponsor using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their sponsor and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. The 1-2 credit option is an additional component tied to any University course of at least 3 credits at the 300 level, with course instructor approval. The 3-6 credit option is a stand-alone independent study designed by the student and faculty sponsor. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66797\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/396ISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[35,"HONORS-495MH"],"x":54.0,"y":1.0,"id":"(35, 'HONORS-495MH')","attributes":{"Title":"GW-Introvert/Extrovert","Description":"Fall\n2015\nHonors College\n495MH\nUMass Amherst\nOne's inner life and one's interactions with others are often affected by tendencies towards being an introvert or an extravert. Using readings from papers and the book Quiet... by Susan Cain, we will explore and discuss how such proclivities from childhood to college and beyond could help us in the roles that we wish to achieve. How do the strengths and weaknesses of such traits inform our leadership abilities now and in the future? Are there ways of changing one's own behaviors to maximize success?\nSr & Jr COMCOL SOCIOL majors\nPermission is required for interchange registration during the add/drop period only.\n36943\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/495MH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[36,"HONORS-196"],"x":31.0,"y":1.0,"id":"(36, 'HONORS-196')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2015\nHonors College\n196\nUMass Amherst\nInvolves frequent interaction between instructor and student.  The student and sponsoring instructor must fill out a contract, which is available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.  Qualitative and quantitative enrichment must be evident on the proposed contract before consent is given to undertake the study.  The 1-2 credit option is an additional component tied to any University course of at least 3 credits at the 100-level, with course instructor approval. The 3- to 6-credit option is a stand-alone independent study designed by the student and faculty sponsor. Registration can be done during pre-reg and should be completed by the end of the add-drop period.\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16281\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/196/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[37,"HONORS-297D"],"x":15.0,"y":1.0,"id":"(37, 'HONORS-297D')","attributes":{"Title":"ST-Intro/New Media Production","Description":"Spring\n2015\nHonors College\n297D\nUMass Amherst\nThis class will teach students the skills necessary to produce, disseminate, publicize, and monetize textual, audio, and video programs on the Internet. These skills include, designing new media programs; writing, recording, and editing new media programs; uploading, storing, serving, and backing up new media programs; software platforms for hosting new media programs; building audiences using social media; tracking audience size and behavior; and creating income streams with new media programs.\nStudents will apply what they learn by creating new media programs on the New Books Network (http://newbooksnetwork.com), a non-profit network of 100 author-interview podcasts. They will edit, compose, upload, publicize, and measure reach of interviews conducted by NBN hosts. As a final project, students will record and produce their own interviews. No prior knowledge of new media production is necessary.\nPermission is required for interchange registration during the add/drop period only.\n19771\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/297D/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[38,"HONORS-292V"],"x":55.0,"y":1.0,"id":"(38, 'HONORS-292V')","attributes":{"Title":"Violence in American Culture","Description":"Spring\n2015\nHonors College\n292V\nUMass Amherst\nThis course will explore the complex social and cultural interactions that can lead to violence. We will begin by examining various theories of human violence from a number of disciplines: anthropology, psychology, and sociology. Students will then survey different cultural attitudes towards violence beginning with several prehistoric sites from the American Southwest and northern Mexico. Next, the course will consider the historical roots of American violence starting with the European invasion of North America. Specific instances of violence in American history will also be considered, including the attempted genocide of American Indians, the enslavement of African Americans, and the American Civil War. The second half of the course will focus on a number of contemporary issues of American violence including race violence, hate crimes, violence against women, family violence, gang violence, and the violence in contemporary art and film. (Gen.Ed. SB, U)\nThis course is open to Senior, Junior, and Sophmore Commonwealth College students only.\nPermission is required for interchange registration during the add/drop period only.\n16299\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/292V/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[39,"HONORS-296ISH"],"x":32.5,"y":1.0,"id":"(39, 'HONORS-296ISH')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2016\nHonors College\n296ISH\nUMass Amherst\nThis is a stand-alone independent study designed by the student and faculty sponsor that involves frequent interaction between instructor and student. The student and sponsoring instructor must fill out a contract, which is available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.  Qualitative and quantitative enrichment must be evident on the proposed contract before consent is given to undertake the study.  Submission can be done during pre-registration and should be done so that registration can be completed by the end of the add-drop period.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Independent Study must complete a contract with their faculty sponsor using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their sponsor and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. The 1-2 credit option is an additional component tied to any University course of at least 3 credits at the 200 level, with course instructor approval. The 3-6 credit option is a stand-alone independent study designed by the student and faculty sponsor. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66795\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/296ISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[40,"HONORS-298IH"],"x":16.0,"y":1.0,"id":"(40, 'HONORS-298IH')","attributes":{"Title":"Honors Advising Assistant Prac","Description":"Spring\n2016\nHonors College\n298IH\nUMass Amherst\nCourse description not available at this time.\nThis course is open to Commonwealth Honors College students only.   Students must complete an application obtained at the Bloom Honors Advising Center, 201 Commonwealth Honors College Building.\nPermission is required for interchange registration during all registration periods.\n66895\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/298IH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[41,"HONORS-196ISH"],"x":12.0,"y":1.0,"id":"(41, 'HONORS-196ISH')","attributes":{"Title":"Honors Independent Study","Description":"Spring\n2016\nHonors College\n196ISH\nUMass Amherst\nThis is a stand-alone independent study designed by the student and faculty sponsor that involves frequent interaction between instructor and student. The student and sponsoring instructor must fill out a contract, which is available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.  Qualitative and quantitative enrichment must be evident on the proposed contract before consent is given to undertake the study.  Submission can be done during pre-registration and should be done so that registration can be completed by the end of the add-drop period.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Independent Study must complete a contract with their faculty sponsor using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their sponsor and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. The 1-2 credit option is an additional component tied to any University course of at least 3 credits at the 100 level, with course instructor approval. The 3-6 credit option is a stand-alone independent study designed by the student and faculty sponsor. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66793\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/196ISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[42,"HONORS-391AH"],"x":56.5,"y":2.0,"id":"(42, 'HONORS-391AH')","attributes":{"Title":"Honors Seminar 2: Topics","Description":"Spring\n2016\nHonors College\n391AH\nUMass Amherst\nThis seminar is a required course for Commonwealth Honors College students where students participate in a topical seminar-style course designed by its instructor.  While the subject matter of each section is different, advanced knowledge of the topic is not required. While the subject matter of each section is different, the requirements for each section are the same.\nOpen to Senior, Junior, and Sophomore Commonwealth College students only.   Be sure to check http://www.honors.umass.edu/honorsseminar\nfor individual titles and descriptions of HONORS 391A sections.  Each section has its own topic chosen by its professor.\nPermission is required for interchange registration during the add/drop period only.\n66816\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/391AH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[43,"HONORS-495LH"],"x":59.0,"y":1.0,"id":"(43, 'HONORS-495LH')","attributes":{"Title":"S-Psychology in the Workplace","Description":"Spring\n2016\nHonors College\n495LH\nUMass Amherst\nThis course will investigate the direct role of psychology in today's workplace.  Multiple dimensions of workplace effectiveness and management will be addressed including: employee hiring, succession planning, management and executive development, talent management, conflict, organizational development, coaching, and others.  An additional area of focus will be on the family business and psychology's unique role in consulting to family businesses.\nPermission is required for interchange registration during the add/drop period only.\n66893\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/495LH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[44,"HONORS-191EH"],"x":60.0,"y":1.0,"id":"(44, 'HONORS-191EH')","attributes":{"Title":"GW-Emerging Scholars Seminar","Description":"Fall\n2015\nHonors College\n191EH\nUMass Amherst\nThis one-credit seminar is designed to assist the Emerging Scholars students\nwith their academic transition to the University of Massachusetts. It was designed to connect students to campus resources including the Commonwealth College.\nOpen to students in the Emerging Scholars Honors HLC program only.\nPermission is required for interchange registration during the add/drop period only.\n36870\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/191EH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[45,"HONORS-391A"],"x":57.0,"y":1.0,"id":"(45, 'HONORS-391A')","attributes":{"Title":"Honors Seminar 2: Topics","Description":"Spring\n2015\nHonors College\n391A\nUMass Amherst\nThis seminar is a required course for Commonwealth Honors College students where students participate in a topical seminar-style course designed by its instructor.  While the subject matter of each section is different, advanced knowledge of the topic is not required. While the subject matter of each section is different, the requirements for each section are the same.\nOpen to Senior, Junior, and Sophomore Commonwealth College students only.   Be sure to check http://www.honors.umass.edu/honorsseminar\nfor individual titles and descriptions of HONORS 391A sections.  Each section has its own topic chosen by its professor.\nPermission is required for interchange registration during the add/drop period only.\n16314\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/391A/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[46,"HONORS-195D"],"x":61.0,"y":1.0,"id":"(46, 'HONORS-195D')","attributes":{"Title":"GW-Front Page I","Description":"Spring\n2015\nHonors College\n195D\nUMass Amherst\nPurpose: An opportunity to discuss current state, national, and global issues and events with talented faculty, distinguished community members, politicians, and influential alums. Class time will be devoted to vibrant and challenging discussions based on critical reading and analysis of newspaper articles on current issues Requirements: Reading the front page stories from the New York Times and the Boston Globe daily. Supplemental reading as needed. Objective: Training students as opinion leaders; to encourage them to be steadily engaged in the social, political and economic concerns of their time; to provide a context for interaction with experts and significant community members, and prepare them with verbal skills that are important in interviews for scholarships, graduate and professional schools, and employment.\nPermission is required for interchange registration during the add/drop period only.\n19400\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/195D/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[47,"HONORS-298"],"x":8.0,"y":1.0,"id":"(47, 'HONORS-298')","attributes":{"Title":"Practicum","Description":"Spring\n2015\nHonors College\n298\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16284\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/298/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[48,"HONORS-398DH"],"x":62.0,"y":1.0,"id":"(48, 'HONORS-398DH')","attributes":{"Title":"Dr. Seuss Museum Practicum","Description":"Spring\n2016\nHonors College\n398DH\nUMass Amherst\nContact COMCOL\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n71029\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/398DH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[49,"HONORS-H391A"],"x":57.5,"y":2.0,"id":"(49, 'HONORS-H391A')","attributes":{"Title":"Honors Colloq for HONORS 391A","Description":"Spring\n2015\nHonors College\nH391A\nUMass Amherst\nIn this 1-credit colloquium, students will engage deeply with material they have already encountered in the regular section of the course through further readings, conversation, and group work.\nOpen to Junior and Sophomore Commonwealth College Students only.   Students must also be enrolled in HONORS 391A (section 21) to participate in this class.\nPermission is required for interchange registration during all registration periods.\n16340\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/H391A/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[50,"HONORS-290D"],"x":63.0,"y":1.0,"id":"(50, 'HONORS-290D')","attributes":{"Title":"The Springfield Renaissance","Description":"Spring\n2015\nHonors College\n290D\nUMass Amherst\nThis course uses the arts as a lens to study various historical sites in downtown Springfield and introduces students to the history of art in Springfield and its impact on the community. (No previous art experience necessary.) The class examines the practical applications of art in relation to history, society, museum and gallery studies, culture and personal expression. Through field trips, guest speakers, written assignments, guided art-making activities in Studio 9, and a final art exhibition at 1350 Gallery, students will gain an overview of the development of Springfield?s identity through art. Field trips include visits to four historic art sites in downtown Springfield, each followed by a two-page written assignment in which students interpret and analyze the experience. There will be a final five-page written assignment based upon art and its impact on society, especially in Springfield. Each of the experiences will also be interpreted though art-making activities in Springfield?s Studio 9. A shuttle to Studio 9 and back to the Haigis Mall will be provided each Friday. By a guided analysis of the artists? ability to change the quality of life in the urban environment, students will develop their own understandings of what art means to them and how they think it contributes to society. Through painting/drawing sessions, guided site visits, guest lectures and a final art reception, students will experience what it takes to make art and the need for its presence in society.\nFive field trips to Springfield will be held, and students will be expected to participate in four of the five.  The field trip schedule will be arranged to accommodate student schedules and shuttle transportation will be provided.\nPermission is required for interchange registration during the add/drop period only.\n16422\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/290D/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[51,"HONORS-298H"],"x":17.0,"y":1.0,"id":"(51, 'HONORS-298H')","attributes":{"Title":"Practicum","Description":"Spring\n2016\nHonors College\n298H\nUMass Amherst\nStudents registering for this Honors Practicum must complete a contract with their honors sponsor. Appropriate forms and more information are available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.\nStudents must apply through CHC PATHS to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66796\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/298H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[52,"HONORS-295CH"],"x":64.0,"y":1.0,"id":"(52, 'HONORS-295CH')","attributes":{"Title":"GW-Preparing for Study Abroad","Description":"Spring\n2016\nHonors College\n295CH\nUMass Amherst\nThis one-credit gateway course is designed for honors students who are thinking about study abroad. Its purpose is to help them answer questions such as the following: Where should I go to study abroad? When is the best time to go? Should I go abroad for one semester or for a full academic year? On what kind of program should I go? The course will enable students to clarify their study abroad goals and to choose the best program to meet these goals.\nThis course is open to Freshmen, Sophomores and Juniors.\nPermission is required for interchange registration during the add/drop period only.\n66855\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/295CH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[53,"HONORS-498"],"x":10.0,"y":1.0,"id":"(53, 'HONORS-498')","attributes":{"Title":"Practicum","Description":"Spring\n2015\nHonors College\n498\nUMass Amherst\nNot available at this time\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16360\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/498/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[54,"THEATER-100H"],"x":65.0,"y":1.0,"id":"(54, 'THEATER-100H')","attributes":{"Title":"Intro To Theater: Honors","Description":"Spring\n2016\nTheater\n100H\nUMass Amherst\nIntroduces nonmajors to theater as a performing art through a wide variety of theatrical experiences including attending live performances and creating original plays. Topics include major styles of theater throughout history and the roles of director, actor, and designer in the contemporary theater. Recommended for first- and second-year students.  (Gen.Ed. AL)\nDESCRIPTION: HONORS GEN ED (AT): The Performance of Identity. This class intertwines basic communication theory with study and performance of archetypical characters in Western Dramatic Literature (such as Henry IV, The Fool, Hedda Gabler, The Founding Father, Buffy). By viewing and performing these timeless characters through the lens of interpersonal and intrapersonal communication theories, the student experiences first hand (and in a larger-than-life context) how to motivate large groups, how to create collaboration out of chaos, how to be just, how to connect viscerally with peers, strangers and intimate friends without the safety net of technological mediation.\nPermission is required for interchange registration during the add/drop period only.\n68905\n \n ","Department Code":"THEA","Course Site":"<a href= '/courses/UM/2016/SPRING/THEATER/100H/01'> Course Site </a>","Requisite":[]},"color":"rgb(253, 50, 204)","size":10.0},{"label":[55,"HONORS-398H"],"x":4.0,"y":1.0,"id":"(55, 'HONORS-398H')","attributes":{"Title":"Practicum","Description":"Spring\n2016\nHonors College\n398H\nUMass Amherst\nStudents registering for this Honors Practicum must complete a contract with their honors sponsor. Appropriate forms and more information are available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.\nStudents must apply through CHC PATHS to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66852\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/398H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[56,"HONORS-495B"],"x":66.0,"y":1.0,"id":"(56, 'HONORS-495B')","attributes":{"Title":"GW-Front Page II","Description":"Fall\n2014\nHonors College\n495B\nUMass Amherst\nThis course engages students in reading domestic and international news outlets and reflecting upon and discussing contemporary issues. Students from all majors are welcome, as the principal prerequisite is an interest in learning more about current events in the US and around the world and discussions with your peers. Front Page has two main goals: to engage students in learning and thinking critically about contemporary events, and to develop your capacity to speak effectively in group settings.  This is an informal, student-centered class: student run the discussions, do most of the talking, and share different perspectives. All serious perspectives are welcomed. Readings include the online version of the New York Times and one international news outlet of your choice.\nOpen to Senior, Junior and Sophomore Commonwealth Honors College students only.\nPermission is required for interchange registration during the add/drop period only.\n76280\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/495B/01'> Course Site </a>","Requisite":["This course engages students in reading domestic and international news outlets and reflecting upon and discussing contemporary issues. Students from all majors are welcome, as the principal prerequisite is an interest in learning more about current events in the US and around the world and discussions with your peers. Front Page has two main goals: to engage students in learning and thinking critically about contemporary events, and to develop your capacity to speak effectively in group settings.  This is an informal, student-centered class: student run the discussions, do most of the talking, and share different perspectives. All serious perspectives are welcomed. Readings include the online version of the New York Times and one international news outlet of your choice."]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[57,"HONORS-396RIS"],"x":67.0,"y":0.0,"id":"(57, 'HONORS-396RIS')","attributes":{"Title":"Honrs Independent Study Option","Description":"Spring\n2016\nHonors College\n396RISH\nUMass Amherst\nVaries from 1 to 2 credits\nPermission is required for interchange registration during all registration periods.\n69640\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/396RISH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[58,"HONORS-252H"],"x":13.0,"y":2.0,"id":"(58, 'HONORS-252H')","attributes":{"Title":"Cross Cultural Prep Seminar","Description":"Spring\n2016\nHonors College\n252H\nUMass Amherst\nThis intercultural communication seminar is designed to help students who are enrolled in the International Scholars Program prepare for their study abroad experience.  It explores the role that culture plays as a medium of communication.  It encourages students to see themselves as members of one or more cultural group and to anticipate what it will be like living, working and communicating in a new cultural environment.  (GenEd. SB, G)\nStudents must apply through CHC PATHS to add this course PreReq: HONORS 251\nPermission is required for interchange registration during the add/drop period only.\n66802\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/252H/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[59,"HONORS-495A"],"x":68.0,"y":1.0,"id":"(59, 'HONORS-495A')","attributes":{"Title":"GW-Leadership/Global Community","Description":"Fall\n2014\nHonors College\n495A\nUMass Amherst\nLeadership in a Global Community is a course designed to introduce future leaders to the concepts of leadership theory that help inform leadership in a global community and may help to identify the strengths and weaknesses of the student?s particular style while reflecting on ways to improve and become better prepared to lead in the 21st Century. In this course, students will study leadership concepts of many perspectives to develop a vision statement. Students will also learn to about ethics in leadership and how this contributes to leading inclusively. Students will also begin an exploration into becoming a transformational leader by challenging some of the stereotypes of successful leaders.\nOpen to Commonwealth Honors College Students only.\nPermission is required for interchange registration during the add/drop period only.\n76336\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/495A/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[60,"HONORS-201"],"x":26.0,"y":1.0,"id":"(60, 'HONORS-201')","attributes":{"Title":"Ideas That Change the World","Description":"Spring\n2015\nHonors College\n201\nUMass Amherst\nIn this seminar, students will examine texts and works of art that have profoundly shaped the world we live in. The course is divided into four units: Models of Inquiry; the Impact of Science and Technology; Social Philosophy and Civic Engagement; and Art in the World. The course is supplemented with several plenary lectures by distinguished honors faculty speakers.\nThis course is open to Commonwealth Honors College students only.\nPermission is required for interchange registration during the add/drop period only.\n16389\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/201/02'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[61,"HONORS-499P"],"x":43.0,"y":1.0,"id":"(61, 'HONORS-499P')","attributes":{"Title":"Honors Project","Description":"Spring\n2016\nHonors College\n499P\nUMass Amherst\nHonors project expectations are high. The intended end-product is a traditional project manuscript with accompanying artifact(s), all projects: \n- are 6 credits or more of sustained research on a single topic, typically conducted over two semesters.\n- begin with creative inquiry and systematic research.\n- include documentation of substantive scholarly endeavor.\n- culminate in an oral defense or other form of public presentation.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Project following their Honors Research (499Y) must have the approval of their faculty committee and must complete a contract proposal with their faculty chair using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their chair and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66799\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/499P/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[62,"HONORS-493AH"],"x":69.0,"y":1.0,"id":"(62, 'HONORS-493AH')","attributes":{"Title":"S- PublicSpeaking/Career&Rsrch","Description":"Spring\n2016\nHonors College\n493AH\nUMass Amherst\nThis class will teach students the basic skills necessary to give engaging, effective, content-rich presentations in a variety of contexts, including research presentations, job interviews, and professional interactions. It will focus on optimizing presentation length, content structure (openings, body, closings), body language, enunciation, moods, pacing, audience-interaction (asking questions, taking questions), props and audio-visual aids. Students will learn by doing and, therefore, be expected to give parts of presentations or presentations frequently. Students will be trained to construct and give effective presentations to academic and professional audiences.\nThis course is open to Senior & Junior Commonwealth Honors College students only.\nPermission is required for interchange registration during the add/drop period only.\n70149\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/493AH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[63,"HONORS-295C"],"x":70.0,"y":1.0,"id":"(63, 'HONORS-295C')","attributes":{"Title":"GW-Preparing for Study Abroad","Description":"Spring\n2015\nHonors College\n295C\nUMass Amherst\nThis one-credit gateway course is designed for honors students who are thinking about study abroad. Its purpose is to help them answer questions such as the following: Where should I go to study abroad? When is the best time to go? Should I go abroad for one semester or for a full academic year? On what kind of program should I go? The course will enable students to clarify their study abroad goals and to choose the best program to meet these goals.\nThis course is open to Freshmen, Sophomores and Juniors.\nPermission is required for interchange registration during the add/drop period only.\n16362\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/295C/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[64,"HONORS-251H"],"x":71.0,"y":1.0,"id":"(64, 'HONORS-251H')","attributes":{"Title":"International Issues","Description":"Fall\n2015\nHonors College\n251H\nUMass Amherst\nThis is the required entry course for students accepted into the International Scholars Program.  Its purpose is to provide students who are intending to study abroad with some of the significant concepts they will need in order to understand the international and national politics of the country where they plan to study.  Prerequisite: acceptance to ISP program. (GenEd. SB, G)\nInternational Scholars Program students only.\nPermission is required for interchange registration during all registration periods.\n36858\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/FALL/HONORS/251H/01'> Course Site </a>","Requisite":["This is the required entry course for students accepted into the International Scholars Program.  Its purpose is to provide students who are intending to study abroad with some of the significant concepts they will need in order to understand the international and national politics of the country where they plan to study.  Prerequisite: acceptance to ISP program. (GenEd. SB, G)"]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[65,"HONORS-495L"],"x":72.0,"y":1.0,"id":"(65, 'HONORS-495L')","attributes":{"Title":"S-Psychology in the Workplace","Description":"Fall\n2014\nHonors College\n495L\nUMass Amherst\nThis course will investigate the direct role of psychology in today's workplace.  Multiple dimensions of workplace effectiveness and management will be addressed including: employee hiring, succession planning, management and executive development, talent management, conflict, organizational development, coaching, and others.  An additional area of focus will be on the family business and psychology's unique role in consulting to family businesses.\nOpen to Senior, Junior and Sophomore Commonwealth Honors College students only.\nPermission is required for interchange registration during the add/drop period only.\n79615\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2014/FALL/HONORS/495L/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[66,"HONORS-397E"],"x":73.0,"y":1.0,"id":"(66, 'HONORS-397E')","attributes":{"Title":"S-Andy Warhol: Lines/Art&Celeb","Description":"Spring\n2015\nHonors College\n397E\nUMass Amherst\nThis course introduces students to the world of the events of high society, power brokers, donors and benefactors, museums, artists, entertainers and celebrities. Through analyzing the work and philosophy of Andy Warhol and his profound impact on contemporary artists such as Banksy, Jeff Koons and Lady Gaga as well as the development of reality television based on the lives of celebrities, students will gain a better understanding of the history and purpose of current societal trends. Students will view a selection of Warhols real time films of celebrities, his cinematic works, interviews and exhibited artworks and collaborations to gain a holistic understanding of his impact on modern thinking.\nPermission is required for interchange registration during the add/drop period only.\n19598\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/397E/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[67,"HONORS-499T"],"x":42.0,"y":1.0,"id":"(67, 'HONORS-499T')","attributes":{"Title":"Honors Thesis","Description":"Spring\n2016\nHonors College\n499T\nUMass Amherst\nHonors project expectations are high. The intended end-product is a traditional project manuscript with accompanying artifact(s), all theses: \n- are 6 credits or more of sustained research on a single topic, typically conducted over two semesters.\n- begin with creative inquiry and systematic research.\n- include documentation of substantive scholarly endeavor.\n- culminate in an oral defense or other form of public presentation.\nStudents must apply through CHC PATHS to add this course   Students wishing to register for an Honors Thesis following their Honors Research (499Y) must have the approval of their faculty committee and must complete a contract proposal with their faculty chair using CHC PATHS (honors.umass.edu/chc-paths/) for online approval by their chair and other reviewers, including the Academic Standards Committee of the Faculty Senate's Commonwealth Honors College Council. Once fully approved it will be registered in SPIRE by Commonwealth Honors College. APPLICATION CAN BE DONE DURING PRE-REG AND SHOULD BE COMPLETED AND SUBMITTED BEFORE CLASSES START TO ENSURE THAT REGISTRATION CAN BE COMPLETED BEFORE ADD/DROP ENDS.\nVaries from 3 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n66800\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/499T/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[68,"HONORS-198"],"x":25.0,"y":1.0,"id":"(68, 'HONORS-198')","attributes":{"Title":"Practicum","Description":"Spring\n2015\nHonors College\n198\nUMass Amherst\nStudents registering for this Honors Practicum must complete a contract with their honors sponsor. Appropriate forms and more information are available at the Bloom Honors Advising Center - 201 Commonwealth Honors College.\nContact the Bloom Honors Advising Center - 201 Commonwealth Honors College - to add this course\nVaries from 1 to 6 credits\nPermission is required for interchange registration during the add/drop period only.\n16282\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2015/SPRING/HONORS/198/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[69,"HONORS-298FH"],"x":74.0,"y":1.0,"id":"(69, 'HONORS-298FH')","attributes":{"Title":"Peer Ambassadors Practicum","Description":"Spring\n2016\nHonors College\n298FH\nUMass Amherst\nDescription not available at this time\nOpen to Junior and Sophomore Commonwealth College Students only.   This class will meet on a weekend, Saturday and Sunday from 10:00AM - 3:00PM. To apply go to honors.umass.edu/peer-ambassadors-0.\nPermission is required for interchange registration during all registration periods.\n66838\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/298FH/01'> Course Site </a>","Requisite":[]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[70,"HONORS-322H"],"x":75.0,"y":1.0,"id":"(70, 'HONORS-322H')","attributes":{"Title":"Criminal Law & Justice in US","Description":"Spring\n2016\nHonors College\n322H\nUMass Amherst\nCrime and punishment are among the most important issues in contemporary America. This course begins with an introduction to the role of the Constitution in criminal law, including due process, equal protection, and the Bill of Rights. It then introduces the students to substantive criminal law, including basic stages of the criminal process, principles underlying the definition of crime such as the requirements of actus reus and mens rea, causation, attempt, complicity, and conspiracy. Substantive offenses covered include homicidal offenses, other offenses against persons, property crimes, white collar and organized crime, vice crimes, and offenses against public health and the environment. Also examined is criminal responsibility and defenses. This course goes on to highlight changes in criminal behavior and theories of punishment, including the different ways that Americans have sought to deter, punish, and rehabilitate. This course addresses the generally ignored issue of crime and criminal jurisdiction in Indian Country. The final weeks of the semester address the role that race, ethnicity, sex, and socioeconomic status play in the criminal justice system outside of Indian Country. This discussion includes the War on Drugs, mandatory minimum sentencing, and private, for-profit prisons. No prerequisites. (Gen.Ed. SB, U)\nOpen to Commonwealth Honors College Students only.\nPermission is required for interchange registration during the add/drop period only.\n69726\n \n ","Department Code":"HONO","Course Site":"<a href= '/courses/UM/2016/SPRING/HONORS/322H/01'> Course Site </a>","Requisite":["Crime and punishment are among the most important issues in contemporary America. This course begins with an introduction to the role of the Constitution in criminal law, including due process, equal protection, and the Bill of Rights. It then introduces the students to substantive criminal law, including basic stages of the criminal process, principles underlying the definition of crime such as the requirements of actus reus and mens rea, causation, attempt, complicity, and conspiracy. Substantive offenses covered include homicidal offenses, other offenses against persons, property crimes, white collar and organized crime, vice crimes, and offenses against public health and the environment. Also examined is criminal responsibility and defenses. This course goes on to highlight changes in criminal behavior and theories of punishment, including the different ways that Americans have sought to deter, punish, and rehabilitate. This course addresses the generally ignored issue of crime and criminal jurisdiction in Indian Country. The final weeks of the semester address the role that race, ethnicity, sex, and socioeconomic status play in the criminal justice system outside of Indian Country. This discussion includes the War on Drugs, mandatory minimum sentencing, and private, for-profit prisons. No prerequisites. (Gen.Ed. SB, U)"]},"color":"rgb(46, 62, 247)","size":10.0},{"label":[71,"Honors-499Y"],"x":41.0,"y":0.0,"id":"(71, 'Honors-499Y')","attributes":{"Title":[71,"Honors-499Y"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[72,"Honors-201"],"x":20.5,"y":0.0,"id":"(72, 'Honors-201')","attributes":{"Title":[72,"Honors-201"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[73,"Honors-195KH"],"x":0.0,"y":0.0,"id":"(73, 'Honors-195KH')","attributes":{"Title":[73,"Honors-195KH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[74,"Honors-191FPH"],"x":1.0,"y":0.0,"id":"(74, 'Honors-191FPH')","attributes":{"Title":[74,"Honors-191FPH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[75,"Honors-221H"],"x":2.0,"y":0.0,"id":"(75, 'Honors-221H')","attributes":{"Title":[75,"Honors-221H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[76,"Honors-195J"],"x":3.0,"y":0.0,"id":"(76, 'Honors-195J')","attributes":{"Title":[76,"Honors-195J"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[77,"Honors-396"],"x":21.5,"y":0.0,"id":"(77, 'Honors-396')","attributes":{"Title":[77,"Honors-396"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[78,"Honors-499C"],"x":35.0,"y":0.0,"id":"(78, 'Honors-499C')","attributes":{"Title":[78,"Honors-499C"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[79,"Honors-451"],"x":3.5,"y":0.0,"id":"(79, 'Honors-451')","attributes":{"Title":[79,"Honors-451"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[80,"Honors-499D"],"x":37.0,"y":0.0,"id":"(80, 'Honors-499D')","attributes":{"Title":[80,"Honors-499D"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[81,"Honors-499O"],"x":38.0,"y":0.0,"id":"(81, 'Honors-499O')","attributes":{"Title":[81,"Honors-499O"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[82,"Honors-398"],"x":22.5,"y":0.0,"id":"(82, 'Honors-398')","attributes":{"Title":[82,"Honors-398"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[83,"Honors-321H"],"x":40.0,"y":0.0,"id":"(83, 'Honors-321H')","attributes":{"Title":[83,"Honors-321H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[84,"Honors-499T"],"x":42.0,"y":0.0,"id":"(84, 'Honors-499T')","attributes":{"Title":[84,"Honors-499T"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[85,"Honors-499P"],"x":43.0,"y":0.0,"id":"(85, 'Honors-499P')","attributes":{"Title":[85,"Honors-499P"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[86,"Honors-198H"],"x":27.0,"y":0.0,"id":"(86, 'Honors-198H')","attributes":{"Title":[86,"Honors-198H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[87,"Honors-291A"],"x":44.0,"y":0.0,"id":"(87, 'Honors-291A')","attributes":{"Title":[87,"Honors-291A"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[88,"Honors-496ISH"],"x":30.0,"y":0.0,"id":"(88, 'Honors-496ISH')","attributes":{"Title":[88,"Honors-496ISH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[89,"Honors-400"],"x":29.0,"y":0.0,"id":"(89, 'Honors-400')","attributes":{"Title":[89,"Honors-400"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[90,"Honors-195G"],"x":45.0,"y":0.0,"id":"(90, 'Honors-195G')","attributes":{"Title":[90,"Honors-195G"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[91,"Honors-391AHH"],"x":46.0,"y":0.0,"id":"(91, 'Honors-391AHH')","attributes":{"Title":[91,"Honors-391AHH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[92,"Honors-496"],"x":28.0,"y":0.0,"id":"(92, 'Honors-496')","attributes":{"Title":[92,"Honors-496"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[93,"Honors-298I"],"x":14.0,"y":0.0,"id":"(93, 'Honors-298I')","attributes":{"Title":[93,"Honors-298I"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[94,"Honors-297DH"],"x":18.0,"y":0.0,"id":"(94, 'Honors-297DH')","attributes":{"Title":[94,"Honors-297DH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[95,"Honors-100"],"x":19.0,"y":0.0,"id":"(95, 'Honors-100')","attributes":{"Title":[95,"Honors-100"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[96,"Honors-498H"],"x":5.0,"y":0.0,"id":"(96, 'Honors-498H')","attributes":{"Title":[96,"Honors-498H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[97,"Honors-195C"],"x":48.0,"y":0.0,"id":"(97, 'Honors-195C')","attributes":{"Title":[97,"Honors-195C"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[98,"Honors-499L"],"x":11.0,"y":0.0,"id":"(98, 'Honors-499L')","attributes":{"Title":[98,"Honors-499L"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[99,"Honors-252"],"x":6.0,"y":0.0,"id":"(99, 'Honors-252')","attributes":{"Title":[99,"Honors-252"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[100,"Honors-495BH"],"x":49.0,"y":0.0,"id":"(100, 'Honors-495BH')","attributes":{"Title":[100,"Honors-495BH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[101,"Honors-495M"],"x":50.0,"y":0.0,"id":"(101, 'Honors-495M')","attributes":{"Title":[101,"Honors-495M"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[102,"Honors-499N"],"x":39.0,"y":0.0,"id":"(102, 'Honors-499N')","attributes":{"Title":[102,"Honors-499N"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[103,"Honors-397C"],"x":52.0,"y":0.0,"id":"(103, 'Honors-397C')","attributes":{"Title":[103,"Honors-397C"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[104,"Honors-296"],"x":34.0,"y":0.0,"id":"(104, 'Honors-296')","attributes":{"Title":[104,"Honors-296"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[105,"Honors-201H"],"x":53.0,"y":0.0,"id":"(105, 'Honors-201H')","attributes":{"Title":[105,"Honors-201H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[106,"Honors-251"],"x":9.0,"y":0.0,"id":"(106, 'Honors-251')","attributes":{"Title":[106,"Honors-251"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[107,"Honors-396ISH"],"x":24.5,"y":0.0,"id":"(107, 'Honors-396ISH')","attributes":{"Title":[107,"Honors-396ISH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[108,"Honors-300"],"x":23.5,"y":0.0,"id":"(108, 'Honors-300')","attributes":{"Title":[108,"Honors-300"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[109,"Honors-495MH"],"x":54.0,"y":0.0,"id":"(109, 'Honors-495MH')","attributes":{"Title":[109,"Honors-495MH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[110,"Honors-196"],"x":31.0,"y":0.0,"id":"(110, 'Honors-196')","attributes":{"Title":[110,"Honors-196"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[111,"Honors-297D"],"x":15.0,"y":0.0,"id":"(111, 'Honors-297D')","attributes":{"Title":[111,"Honors-297D"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[112,"Honors-292V"],"x":55.0,"y":0.0,"id":"(112, 'Honors-292V')","attributes":{"Title":[112,"Honors-292V"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[113,"Honors-296ISH"],"x":32.0,"y":0.0,"id":"(113, 'Honors-296ISH')","attributes":{"Title":[113,"Honors-296ISH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[114,"Honors-200"],"x":33.0,"y":0.0,"id":"(114, 'Honors-200')","attributes":{"Title":[114,"Honors-200"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[115,"Honors-298IH"],"x":16.0,"y":0.0,"id":"(115, 'Honors-298IH')","attributes":{"Title":[115,"Honors-298IH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[116,"Honors-196ISH"],"x":12.0,"y":0.0,"id":"(116, 'Honors-196ISH')","attributes":{"Title":[116,"Honors-196ISH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[117,"Honors-391AH"],"x":56.0,"y":0.0,"id":"(117, 'Honors-391AH')","attributes":{"Title":[117,"Honors-391AH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[118,"Honors-495LH"],"x":59.0,"y":0.0,"id":"(118, 'Honors-495LH')","attributes":{"Title":[118,"Honors-495LH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[119,"Honors-191EH"],"x":60.0,"y":0.0,"id":"(119, 'Honors-191EH')","attributes":{"Title":[119,"Honors-191EH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[120,"Honors-391A"],"x":57.0,"y":0.0,"id":"(120, 'Honors-391A')","attributes":{"Title":[120,"Honors-391A"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[121,"Honors-195D"],"x":61.0,"y":0.0,"id":"(121, 'Honors-195D')","attributes":{"Title":[121,"Honors-195D"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[122,"Honors-298"],"x":8.0,"y":0.0,"id":"(122, 'Honors-298')","attributes":{"Title":[122,"Honors-298"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[123,"Honors-398DH"],"x":62.0,"y":0.0,"id":"(123, 'Honors-398DH')","attributes":{"Title":[123,"Honors-398DH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[124,"Honors-H391A"],"x":58.0,"y":0.0,"id":"(124, 'Honors-H391A')","attributes":{"Title":[124,"Honors-H391A"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[125,"Honors-290D"],"x":63.0,"y":0.0,"id":"(125, 'Honors-290D')","attributes":{"Title":[125,"Honors-290D"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[126,"Honors-298H"],"x":17.0,"y":0.0,"id":"(126, 'Honors-298H')","attributes":{"Title":[126,"Honors-298H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[127,"Honors-295CH"],"x":64.0,"y":0.0,"id":"(127, 'Honors-295CH')","attributes":{"Title":[127,"Honors-295CH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[128,"Honors-498"],"x":10.0,"y":0.0,"id":"(128, 'Honors-498')","attributes":{"Title":[128,"Honors-498"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[129,"HONORS-ED"],"x":65.0,"y":0.0,"id":"(129, 'HONORS-ED')","attributes":{"Title":[129,"HONORS-ED"],"Description":"not offered in the last 4 semesters","Department Code":"HONORS","Course Site":"","Requisite":""},"color":"rgb(46, 62, 247)","size":10.0},{"label":[130,"Honors-398H"],"x":4.0,"y":0.0,"id":"(130, 'Honors-398H')","attributes":{"Title":[130,"Honors-398H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[131,"Honors-495B"],"x":66.0,"y":0.0,"id":"(131, 'Honors-495B')","attributes":{"Title":[131,"Honors-495B"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[132,"Honors-252H"],"x":13.0,"y":0.0,"id":"(132, 'Honors-252H')","attributes":{"Title":[132,"Honors-252H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[133,"Honors-495A"],"x":68.0,"y":0.0,"id":"(133, 'Honors-495A')","attributes":{"Title":[133,"Honors-495A"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[134,"Honors-493AH"],"x":69.0,"y":0.0,"id":"(134, 'Honors-493AH')","attributes":{"Title":[134,"Honors-493AH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[135,"Honors-295C"],"x":70.0,"y":0.0,"id":"(135, 'Honors-295C')","attributes":{"Title":[135,"Honors-295C"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[136,"Honors-251H"],"x":71.0,"y":0.0,"id":"(136, 'Honors-251H')","attributes":{"Title":[136,"Honors-251H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[137,"Honors-495L"],"x":72.0,"y":0.0,"id":"(137, 'Honors-495L')","attributes":{"Title":[137,"Honors-495L"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[138,"Honors-397E"],"x":73.0,"y":0.0,"id":"(138, 'Honors-397E')","attributes":{"Title":[138,"Honors-397E"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[139,"Honors-198"],"x":25.5,"y":0.0,"id":"(139, 'Honors-198')","attributes":{"Title":[139,"Honors-198"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[140,"Honors-298FH"],"x":74.0,"y":0.0,"id":"(140, 'Honors-298FH')","attributes":{"Title":[140,"Honors-298FH"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0},{"label":[141,"Honors-322H"],"x":75.0,"y":0.0,"id":"(141, 'Honors-322H')","attributes":{"Title":[141,"Honors-322H"],"Description":"not offered in the last 4 semesters","Department Code":"Honors","Course Site":"","Requisite":""},"color":"rgb(148, 14, 228)","size":10.0}],"edges":[{"label":"","source":"25","target":"7","id":"6","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"25","target":"24","id":"8","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"28","target":"9","id":"10","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"33","target":"7","id":"12","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"33","target":"25","id":"14","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"33","target":"58","id":"16","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"45","target":"42","id":"18","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"45","target":"45","id":"20","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"45","target":"49","id":"22","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"71","target":"12","id":"24","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"71","target":"12","id":"26","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"4","id":"28","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"10","id":"30","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"13","id":"32","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"15","id":"34","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"19","id":"36","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"20","id":"38","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"22","id":"40","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"25","id":"42","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"31","id":"44","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"34","id":"46","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"36","id":"48","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"36","id":"50","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"39","id":"52","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"40","id":"54","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"41","id":"56","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"47","id":"58","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"51","id":"60","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"53","id":"62","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"55","id":"64","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"60","id":"66","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"68","id":"68","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"72","target":"68","id":"70","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"73","target":"0","id":"72","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"74","target":"1","id":"74","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"75","target":"2","id":"76","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"76","target":"3","id":"78","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"77","target":"4","id":"80","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"78","target":"5","id":"82","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"79","target":"7","id":"84","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"80","target":"8","id":"86","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"81","target":"9","id":"88","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"82","target":"10","id":"90","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"83","target":"11","id":"92","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"84","target":"12","id":"94","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"84","target":"67","id":"96","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"85","target":"12","id":"98","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"85","target":"61","id":"100","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"86","target":"13","id":"102","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"87","target":"14","id":"104","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"88","target":"15","id":"106","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"89","target":"15","id":"108","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"90","target":"16","id":"110","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"91","target":"17","id":"112","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"92","target":"19","id":"114","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"93","target":"20","id":"116","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"94","target":"21","id":"118","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"95","target":"21","id":"120","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"95","target":"36","id":"122","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"95","target":"37","id":"124","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"95","target":"41","id":"126","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"96","target":"22","id":"128","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"97","target":"23","id":"130","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"98","target":"24","id":"132","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"99","target":"25","id":"134","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"100","target":"26","id":"136","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"101","target":"27","id":"138","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"102","target":"28","id":"140","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"103","target":"30","id":"142","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"104","target":"31","id":"144","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"105","target":"32","id":"146","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"106","target":"33","id":"148","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"107","target":"34","id":"150","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"108","target":"34","id":"152","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"109","target":"35","id":"154","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"110","target":"36","id":"156","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"111","target":"37","id":"158","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"112","target":"38","id":"160","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"113","target":"39","id":"162","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"114","target":"39","id":"164","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"115","target":"40","id":"166","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"116","target":"41","id":"168","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"117","target":"42","id":"170","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"118","target":"43","id":"172","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"119","target":"44","id":"174","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"120","target":"45","id":"176","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"121","target":"46","id":"178","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"122","target":"47","id":"180","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"123","target":"48","id":"182","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"124","target":"49","id":"184","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"125","target":"50","id":"186","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"126","target":"51","id":"188","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"127","target":"52","id":"190","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"128","target":"53","id":"192","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"129","target":"54","id":"194","attributes":{},"color":"rgb(253, 50, 204)","size":1.0},{"label":"","source":"130","target":"55","id":"196","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"131","target":"56","id":"198","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"132","target":"58","id":"200","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"133","target":"59","id":"202","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"134","target":"62","id":"204","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"135","target":"63","id":"206","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"136","target":"64","id":"208","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"137","target":"65","id":"210","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"138","target":"66","id":"212","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"139","target":"68","id":"214","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"140","target":"69","id":"216","attributes":{},"color":"rgb(46, 62, 247)","size":1.0},{"label":"","source":"141","target":"70","id":"218","attributes":{},"color":"rgb(46, 62, 247)","size":1.0}]}