{"nodes":[{"label":[0,"CLASS-395"],"x":0.0,"y":0.0,"id":"0","attributes":{"Title":"Independent Study","Description":"Spring\n2015\nClassics\n395\nMount Holyoke College\n1.00-8.00 credits.\nPermission is required for interchange registration during all registration periods.\n92692\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/SPRING/CLASS/395/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[1,"CLASS-226"],"x":1.0,"y":0.0,"id":"1","attributes":{"Title":"Polit/Entertainment Anc. Rome","Description":"Spring\n2016\nClassics\n226\nMount Holyoke College\nBread and circuses (panem et circenses) was a catchphrase in the Roman empire that described the political strategy of controlling an unruly populace through free bread and public entertainment. Against a backdrop of Roman social and political institutions, this course focuses on the imperial ideology, aristocratic ethos, and cultural practices that underpinned this catchphrase, as well as questions concerning the careers of entertainers--gladiators, charioteers, and actors--who were at once celebrities and social outcasts; the rules of spectatorship at the games; the use of these games as a form of social control; and the logistics of feeding the city population.\nPermission is required for interchange registration during the add/drop period only.\n95506,95483\n95483\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2016/SPRING/CLASS/226/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[2,"CLASS-349"],"x":2.0,"y":0.0,"id":"2","attributes":{"Title":"Socrates Against the Sophists","Description":"Spring\n2015\nClassics\n349\nMount Holyoke College\nIn a number of Plato's dialogues we find the character Socrates debating various sophists--itinerant teachers-for-hire whose views were often diametrically opposed to Socrates' own. This seminar is structured around a close, careful reading of three such dialogues: the Euthydemus, the Protagoras, and the Gorgias. These dialogues will offer a general introduction to Socratic philosophy, but we will also focus on a few issues in much greater detail. Chief among those special topics will be questions about the nature and value of moral knowledge, the possibility of moral education, and the efficacy of the Socratic method of inquiry.\nPrereq: 8 credits in Philosophy or Classics (or in a combination of Philosophy and Classics).\nPermission is required for interchange registration during the add/drop period only.\n91071,91590\n91071\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/SPRING/CLASS/349/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[3,"CLASS-225"],"x":3.0,"y":0.0,"id":"3","attributes":{"Title":"Athenian Democracy & Its Foes","Description":"Spring\n2015\nClassics\n225\nMount Holyoke College\nDemocracy first took root in Athens in the late sixth century BCE and flourished, with only brief interruptions, until the city came under the power of Macedon in the latter part of the fourth century BCE. This course will trace the  development  of Athenian democracy and examine such topics as citizenship; the role of women, the family, and non-citizens in Athens; the legal system; education; and public entertainment. It will also compare democratic Athens with Sparta, its antithesis in the classical period. Sources will include Herodotus, Thucydides, Aristophanes, Plato, Aristotle, Demosthenes, and others.\nPermission is required for interchange registration during the add/drop period only.\n91067\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/SPRING/CLASS/225/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[4,"CLASS-228"],"x":4.0,"y":0.0,"id":"4","attributes":{"Title":"Ancient Rome","Description":"Fall\n2015\nClassics\n228\nMount Holyoke College\nAncient Rome and its empire can be viewed both as a measure of human achievement and a cautionary tale of the corrupting effects of unbridled power. This course covers the history of Ancient Rome from its mythologized beginnings (753 BCE) to the rise and spread of Christianity under the Emperor Constantine (312 CE). Topics include the creation and development of Rome's republican form of government as well as its eventual transition to monarchy, the causes and consequences of the acquisition of empire, the role of the army in administering the provinces and defending the frontiers, the image of emperor, the economy, and religion.\nPermission is required for interchange registration during the add/drop period only.\n93143,93384\n93143\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/FALL/CLASS/228/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[5,"CLASS-212"],"x":5.0,"y":0.0,"id":"5","attributes":{"Title":"Greek Tragedy and Film","Description":"Spring\n2016\nClassics\n212\nMount Holyoke College\nThis course examines the evolution of tragedy in classical Athens from choral performance to sophisticated drama through the contributions of the three most important tragedians: Aeschylus, Sophocles, and Euripides. Attention is given both to the political context in which the plays were performed and to the dramatic effects employed by the playwrights that made the stage an influential medium of powerful artistry. Students will also study the influence of ancient tragedy on film by examining dramatic strategies modern directors employ and the allusions to Greek tragedy found in some innovative films by Roman Polanski, Woody Allen, Jules Dassin, Michael Cacoyannis, and others.\n2 meetings (75 minutes) plus 1 screening\nPermission is required for interchange registration during the add/drop period only.\n95572,94745\n94745\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2016/SPRING/CLASS/212/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[6,"CLASS-231"],"x":6.0,"y":0.0,"id":"6","attributes":{"Title":"The City of Athens","Description":"Spring\n2016\nClassics\n231\nMount Holyoke College\nA detailed survey of the principal surviving monuments and the overall architectural development of the city of Athens from its origins in the Bronze Age to the end of the 4th century C.E. The archaeological evidence will be discussed against a broader cultural and historical background, with an emphasis on the specific people and events that helped to shape the city and the general social and political circumstances that gave the monuments meaning.\nPermission is required for interchange registration during the add/drop period only.\n94746,95464\n94746\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2016/SPRING/CLASS/231/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[7,"CLASS-211"],"x":7.0,"y":0.0,"id":"7","attributes":{"Title":"Gods & Mortals","Description":"Fall\n2015\nClassics\n211\nMount Holyoke College\nWe will accompany Odysseus on his return from Troy, retrieve the Golden Fleece with Jason, and race with Ovid through his witty--and often troubling--retelling of Greek myths from a Roman perspective. This course examines how Greek and Roman authors and artists from very different periods used myth to explore questions about life, art, and politics. Works include: Homer, Odyssey; Apollonius of Rhodes, Argonautica; Ovid, Metamorphoses and Heroides; Greek tragedy, and ancient images representing myths.\nTaught in English. Optional screenings of films related to ancient myth.\nPermission is required for interchange registration during the add/drop period only.\n93005\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/FALL/CLASS/211/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[8,"CLASS-260"],"x":8.0,"y":0.0,"id":"8","attributes":{"Title":"Knowing God","Description":"Spring\n2015\nClassics\n260\nMount Holyoke College\nThis course examines the following key texts from the ancient world that treat significantly the problem of knowing God and the mystery enveloping such knowledge: Sophocles' Oedipus the King, Plato's Phaedo, Cicero's Concerning the Nature of the Gods, Job, Paul's Epistle to the Romans, and others. Attention is also given to the different ways of thinking about the divine and human natures in these works, which are broadly reflective of Graeco-Roman and Judaeo-Christian value systems.\nPermission is required for interchange registration during the add/drop period only.\n91070\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2015/SPRING/CLASS/260/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0},{"label":[9,"CLASS-205"],"x":9.0,"y":0.0,"id":"9","attributes":{"Title":"Cleopatra","Description":"Fall\n2014\nClassics\n205\nMount Holyoke College\nIn this course Cleopatra will be considered both as a political figure of importance in her own right and also as an enemy queen, representing a presumptuous challenge to the political hegemony and cultural values of the Romans. She may serve, therefore, as a lens through which one may view social and political tensions within Roman society over the nature of authority and empire. Readings include Vergil, Horace, Propertius, Lucan, Caesar, Sallust, Plutarch and the plays of Shakespeare and Shaw, where she is ambivalently portrayed as a woman who desires power or, contrariwise, as a romantic idealist who scorns temporal powers in fulfillment of private desires.\nPermission is required for interchange registration during the add/drop period only.\n89426\n \n ","Department Code":"CLAS","Course Site":"<a href= '/courses/MHC/2014/FALL/CLASS/205/01'> Course Site </a>","Requisite":[]},"color":"rgb(128, 124, 157)","size":10.0}],"edges":[{"label":"","source":"0","target":"0","id":"6","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"1","target":"1","id":"8","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"2","target":"2","id":"10","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"3","target":"3","id":"12","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"4","target":"4","id":"14","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"5","target":"5","id":"16","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"6","target":"6","id":"18","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"7","target":"7","id":"20","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"8","target":"8","id":"22","attributes":{},"color":"rgb(128, 124, 157)","size":1.0},{"label":"","source":"9","target":"9","id":"24","attributes":{},"color":"rgb(128, 124, 157)","size":1.0}]}