{"edges":[{"label":"","source":"0","target":"0","id":"6","attributes":{},"color":"rgb(189, 182, 188)","size":1.0},{"label":"","source":"0","target":"2","id":"8","attributes":{},"color":"rgb(194, 237, 93)","size":1.0},{"label":"","source":"1","target":"1","id":"10","attributes":{},"color":"rgb(105, 105, 201)","size":1.0},{"label":"","source":"1","target":"4","id":"12","attributes":{},"color":"rgb(189, 182, 188)","size":1.0},{"label":"","source":"2","target":"0","id":"14","attributes":{},"color":"rgb(189, 182, 188)","size":1.0},{"label":"","source":"2","target":"2","id":"16","attributes":{},"color":"rgb(194, 237, 93)","size":1.0},{"label":"","source":"3","target":"3","id":"18","attributes":{},"color":"rgb(189, 182, 188)","size":1.0},{"label":"","source":"4","target":"1","id":"20","attributes":{},"color":"rgb(105, 105, 201)","size":1.0},{"label":"","source":"4","target":"4","id":"22","attributes":{},"color":"rgb(189, 182, 188)","size":1.0}],"nodes":[{"label":"ARC-135","x":0.0,"y":0.0,"id":"0","attributes":{"Title":"INTRODUCTION TO ARCHAEOLOGY","Description":"Fall\n2015\nArchaeology\n135\nSmith College\nSame as ANT 135. This course studies past cultures and societies through their material remains. Explores how archaeologists use different field methods, analytical techniques and theoretical approaches to investigate, reconstruct and learn from the past. Data from settlement surveys, site excavations and artifact analysis are used to address economic, social, political and ideological questions across time and space. This course is taught from an anthropological perspective, exploring key transitions in human prehistory, including the origins of food production, social inequality and state-level societies across the globe. Relevance of archaeological practice in modern political, economic and social contexts is explored. Limited to first-year students and sophomores. Enrollment limited to 30.\nLimited to first-years, sophomores.\nPermission is required for interchange registration during the add/drop period only.\n18048\n18952-F15\n \n ","Department Code":"ARC","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/SC/2015/FALL/ARC/135/01'> Course Site </a>","Requisite":[]},"color":"rgb(189, 182, 188)","size":10.0},{"label":"GEO-112","x":1.0,"y":1.0,"id":"1","attributes":{"Title":"ARCHAEOL GEOLOGY: ROCK & STONE","Description":"Spring\n2016\nGeosciences\n112\nSmith College\nSame as ARC 112. What makes a mineral or a rock particularly useful as a stone tool or attractive as a sculpture? Students in this course explore this and other questions by applying geological approaches and techniques in studying various examples or rock art and stone artifacts to learn more about human behavior, ecology and cultures in the past. This exploration across traditional boundaries between archaeology and earth science include background topics of mineral and rock formation, weathering processes and age determination, as well as investigations of petroglyphs (carvings into stone surfaces), stone artifacts and other artifactual rocks (building stone and sculptures) described in the literature, displayed in museum collections, and found in the field locally.\nPermission is required for interchange registration during the add/drop period only.\n41707\n41460-S16\n \n ","Department Code":"GEO","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/SC/2016/SPRING/GEO/112/01'> Course Site </a>","Requisite":[]},"color":"rgb(105, 105, 201)","size":10.0},{"label":"ANT-135","x":0.0,"y":1.0,"id":"2","attributes":{"Title":"INTRODUCTION TO ARCHAEOLOGY","Description":"Fall\n2015\nAnthropology\n135\nSmith College\nSame as ARC 135. This course studies past cultures and societies through their material remains and explores how archaeologists use different field methods, analytical technique and theoretical approaches to investigate, reconstruct and learn from the past. Data from settlement surveys, site excavations and artifact analysis are used to address economic, social, political and ideological questions across time and space. This course is taught from an anthropological perspective, exploring key transitions in human prehistory, including the origins of food production, social inequality and state-level societies across the globe. Relevance of archaeological practice in modern political, economic and social contexts is explored. Limited to first-year students and sophomores. Enrollment limited to 30.\nLimited to first-years, sophomores.\nPermission is required for interchange registration during the add/drop period only.\n18952\n18048-F15\n \n ","Department Code":"ANT","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/SC/2015/FALL/ANT/135/01'> Course Site </a>","Requisite":[]},"color":"rgb(194, 237, 93)","size":10.0},{"label":"ARC-400","x":2.0,"y":0.0,"id":"3","attributes":{"Title":"SPECIAL STUDIES","Description":"Spring\n2016\nArchaeology\n400\nSmith College\nBy permission of the Archaeology Advisory Committee, for junior or senior minors.\nPermission Instructor/Chair.   Not open to first-years\n2 or 4 credits\nPermission is required for interchange registration during all registration periods.\n32428-S16\n \n ","Department Code":"ARC","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/SC/2016/SPRING/ARC/400/0'> Course Site </a>","Requisite":[]},"color":"rgb(189, 182, 188)","size":10.0},{"label":"ARC-112","x":1.0,"y":0.0,"id":"4","attributes":{"Title":"ARCHAEOL GEOLOGY: ROCK & STONE","Description":"Spring\n2016\nArchaeology\n112\nSmith College\nSame as GEO 112. What makes a mineral or a rock particularly useful as a stone tool or attractive as a sculpture? Students in this course will explore this and other questions by applying geological approaches and techniques in studying various examples or rock art and stone artifacts to learn more about human behavior, ecology and cultures in the past. This exploration across traditional boundaries between archaeology and earth science will include background topics of mineral and rock formation, weathering processes, and age determination, as well as investigations of petroglyphs (carvings into stone surfaces), stone artifacts and other artifactual rocks (building stone and sculptures) described in the literature, displayed in museum collections, and found in the field locally.\nPermission is required for interchange registration during the add/drop period only.\n41460\n41707-S16\n \n ","Department Code":"ARC","Course Site":"<a href= 'https://www.fivecolleges.edu/courses/SC/2016/SPRING/ARC/112/01'> Course Site </a>","Requisite":[]},"color":"rgb(189, 182, 188)","size":10.0}]}